[
    {
  "session": 48,
  "chapter": 10,
  "title": "Talis’ Lodge",
  "date": "19th of Kythorn",
  "characters": [
    "Talis the White"
  ],
  "summary": "The group emerges from a portal into a cold mountain forest and discovers a secluded lodge belonging to Talis the White. After defeating trolls and drakes guarding the area, they confront and kill Talis, capturing one of her scouts. From her, they learn that Rezmir fled north and that Talis has been replaced by a new Wyrmspeaker, Varram the White. As they rest uneasily, strange visions and a looming flying castle escorted by a white dragon appear in the skies above Parnast.",
  "full_text": "After stepping through the portal, the group finds themselves in a cold mountain region surrounded by dense forest. Following a narrow trail, they spot a lone cabin emanating faint magical energy. Astaroth sends Paimon to scout ahead, but the demon is repelled by an invisible Mythal barrier that forbids the entry of fiends. As they approach, trolls and drakes attack but are swiftly dispatched by the group’s combined power.\n\nReaching the lodge, two cultists greet them with surprising civility, questioning Soren’s intentions and claiming that Rezmir is not present. Soon, the leader of the household is called — Talis the White, a powerful Wyrmspeaker, revered by her followers. A tense conversation devolves into chaos, and a fierce battle ensues inside the cabin. The group emerges victorious, killing Talis and capturing one of her scouts for interrogation.\n\nThat night, they rest in the warmth of the lodge’s beds but find no peace — strange dreams of Raulothim plague their minds. At dawn, they awaken feeling drained. Advenssax, while keeping watch, witnesses the apparition of a robed man with a goatee who vanishes without a word. When questioned, their elven prisoner reveals that Rezmir had passed through recently, fleeing north, and that Talis had been demoted from Wyrmspeaker to Wearer of Purple, replaced by a man named Varram the White. She knows little of the Red Wizards of Thay, but mentions that one was helping to transport treasure for the cult.\n\nAs the group prepares to leave, the air turns frigid, clouds swirl unnaturally, and a colossal flying castle appears overhead — escorted by a massive white dragon — soaring toward the northern peaks of Parnast."
    },
    {
  "session": 49,
  "chapter": 10,
  "title": "Parnast",
  "date": "19th of Kythorn",
  "characters": [
    "Captain Othelstan"
  ],
  "summary": "Following the flying castle, the group arrives at the small village of Parnast. Disguised as travelers, they interact with cultists and the local captain, who appears to be a Wearer of Purple. After infiltrating the village and discovering that the cult is working alongside giants, a battle breaks out. Though the captain escapes on a wyvern, the group secures vital information about the cult and prepares to pursue the flying castle.",
  "full_text": "Pursuing the flying fortress through the mountain winds, the group descends upon the quiet settlement of Parnast. The village is small and eerily calm, its people subdued under the cult’s control. In the central square, five cultists stand watch, halting the group’s progress. Pretending to be simple travelers, the party introduces themselves under false names. Their deception works long enough for the guards to summon the local captain — a man clad in purple robes, clearly a high-ranking cultist.\n\nAfter a tense exchange, the captain accepts their story and orders one of his guards to escort the group to the local tavern. Inside, the adventurers gather to discuss their next move. Using Paimon as a scout outside, they confirm that the Cult of the Dragon has formed an alliance with giants, likely tied to the flying castle they witnessed earlier.\n\nInfiltrating the captain’s quarters, the group discovers a book containing valuable details about the cult’s activities in the region. Their success is short-lived, however, as the captain and his men return, forcing an intense skirmish through the village streets. The cultists are slain, but the captain narrowly escapes on the back of a wyvern, vanishing into the stormy sky.\n\nWith the town liberated and the surviving villagers gathered safely in the tavern, the heroes prepare for their next daring move — to ascend into the clouds and confront whatever awaits them within the flying castle."
    }

]