[
  {
    "session": 6,
    "chapter": 2,
    "title": "Journey to the Cult’s Camp",
    "date": "28th–30th of Ches",
    "characters": [
      "Eru",
      "Advenssax",
      "Asteria",
      "Soren",
      "Astaroth",
      "Cultists",
      "Kobolds"
    ],
    "summary": "The group departs for their mission to infiltrate the Cult of the Dragon’s encampment. Eru reconciles with Advenssax and Asteria during the calm journey. Upon arrival, they disguise themselves as mercenaries and approach the camp, but a slip in conversation reveals their deception, forcing them into combat and leading to a violent interrogation of a surviving cultist.",
    "full_text": "After saying farewell to Charles, the group finally prepared to embark on their assigned mission — a second journey together. Returning to Escobert, they finalized their preparations and set off south. The road was calm, allowing Eru to make amends with Advenssax, who accepted the apology, claiming no resentment. Eru then approached Asteria, asking if she distrusted the group since she kept her belongings close. She replied calmly that she neither trusted nor distrusted anyone yet — they had only traveled together for a tenday.\n\nAs the landscape shifted into rocky plains, they heard the distant sounds of kobolds and cultists celebrating. Realizing their goal was near, Advenssax disguised himself, painting his scales as part of the infiltration plan. Soren took the lead, claiming they were mercenaries late to join the cult’s operation. His silver tongue convinced the guards initially, but one careless question about their payment raised suspicion. The cultists began testing Soren’s loyalty to Tiamat. Eru, using his magic, tried to answer one of the tests for him, but it only deepened their doubts. When Soren failed their final challenge, a chaotic fight broke out, ending with every cultist and kobold slain except one.\n\nThe survivor was interrogated under promise of freedom. He revealed critical information: Langdedrosa outranked Ghesh, Frulam Mondath was the cult’s divine commander, and the phrase of loyalty was ‘The Mother of Dragons, blessed be Tiamat’s glory, shall return — and all nations will tremble before her majesty.’ He confirmed dragon eggs were being kept at the camp’s infirmary near the main tent, guarded by elite soldiers. He also described the camp’s pentagonal layout, with kobolds guarding one watchtower and mercenaries the other. When all questions were answered, Astaroth extended a hand to release him — only for Eru to unleash a thunderous strike that nearly killed the man. As Astaroth intervened in fury, Soren finished the cultist off. Enraged, Astaroth accused them of being untrustworthy worms who couldn’t honor a deal, storming off under threat to attack Eru if he spoke again."
  },
  {
    "session": 7,
    "chapter": 2,
    "title": "The Cultist Encampment — Part I",
    "date": "30th of Ches",
    "characters": [
      "Eru",
      "Advenssax",
      "Asteria",
      "Soren",
      "Astaroth",
      "Frulam Mondath",
      "Langdedrosa Cyanwrath",
      "Ghesh",
      "Sir Bradley"
    ],
    "summary": "Following internal tensions, the group is ambushed near the mountains but overcomes their attackers. They later infiltrate the Cult’s camp disguised as mercenaries and witness a ritual where Frulam, Ghesh, and Langdedrosa crucify Leosin alive. The group begins planning a dangerous nighttime rescue.",
    "full_text": "After the conflict among them, the group continued their march until reaching a mountainous area, where they were ambushed by cultists, clerics, and a commanding officer. Boulders rained from above, wounding both travelers and beasts, but the adventurers managed to prevail after a grueling battle. The surviving cleric refused to speak and was executed. Using the enemy’s camp for shelter, the party discussed strategy, though their rest was disturbed by throbbing headaches and strange visions — one of Advenssax, another of a tower alarm.\n\nDeciding to move on, they left Advenssax behind as lookout while the others infiltrated the cult’s camp. At the entrance, kobolds greeted them without suspicion, referring to someone named Sir Bradley, who awaited their arrival. Soon they met the man — a one-eyed commander who barked orders and berated delays. After delivering their ‘spoils from Greenest,’ Bradley advised Astaroth to seek the mercenary commander for work. The group mingled near a bonfire among mercenaries, sharing drinks and stories.\n\nPast midnight, chaos gave way to grim spectacle. Frulam Mondath, Ghesh, and Langdedrosa Cyanwrath arrived with a prisoner. Before the horrified eyes of many, the cultists conducted a ritual, crucifying the man alive while proclaiming Tiamat’s glory. Then, at Frulam’s signal, the Blue Dragon swooped over the camp, its roar shaking the ground as it flew toward Berdusk. As cultists cheered and feasted, the group realized the crucified man was none other than Leosin, the monk they had been sent to rescue. They withdrew to plan his extraction, deciding that Soren would command beasts to assist in their escape, Eru would lull the kobolds to sleep, and illusions would mask Leosin’s absence. Meanwhile, far away, Advenssax vowed to never again be left behind."
  },
  {
    "session": 8,
    "chapter": 2,
    "title": "The Cultist Encampment — Part II",
    "date": "1st of Tarsakh (Early Morning)",
    "characters": [
      "Eru",
      "Advenssax",
      "Asteria",
      "Soren",
      "Astaroth",
      "Aldous Khosann",
      "Black Eagles"
    ],
    "summary": "As the group prepares their rescue, they are captured by the mercenary leader Aldous Khosann of the Black Eagles. After a tense interrogation, Aldous allows them to leave on the condition they keep his involvement secret. They carry out Leosin’s rescue amid the chaos and flee the camp under threat of pursuit.",
    "full_text": "While waiting for the cultists to tire from their revelry, the group’s rest was shattered when mercenaries burst into their tent, weapons drawn. Surrounded, they were taken before a man in his fifties — Aldous Khosann, leader of the Black Eagles. Behind him hung a crimson banner emblazoned with a black eagle. The revelation stunned Asteria, whose family had been destroyed by his company.\n\nAldous interrogated them about their infiltration, demanding to know their origins and intent. Eru faltered, and the others tried to speak coherently. When questioned about Leosin, Soren lied, denying any connection — only for Eru to break down and reveal the truth. Blades pressed against their throats until Astaroth admitted the rescue was real, calming the mercenaries. Aldous then offered an unexpected deal: he would let them live if they completed their mission and swore silence about the encounter.\n\nBaffled but alive, the group left, shaken by the ordeal. Once the cultists’ festivities subsided, they executed their plan flawlessly, freeing Leosin and escaping into the night. As they fled, a mercenary warned them to ride hard — a hunt would soon follow."
  },
    {
    "session": 9,
    "chapter": 2,
    "title": "Escape from the Camp",
    "date": "1st of Tarsakh",
    "characters": [
      "Eru",
      "Advenssax",
      "Asteria",
      "Soren",
      "Astaroth",
      "Leosin",
      "Aldous Khosann",
      "Black Eagles",
      "Frulam Mondath",
      "Langdedrosa Cyanwrath"
    ],
    "summary": "After rescuing Leosin, the group flees the cultist camp, burdened by secrets and internal conflict. Tension rises as they debate whether to obey the Black Eagles’ warning or defy them. Along the road, Leosin reveals truths about the Cult and hints of greater dangers ahead.",
    "full_text": "Reuniting with Advenssax, who had been left unconscious and bound, the group quickly freed him. Before fully awakening, memories of his tribe’s destruction by Lennithon — the blue dragon that attacked Greenest — flashed through his mind, igniting his rage. Once recovered, the group prepared to flee, placing the weakened Leosin in the wagon.\n\nAs they traveled, they agreed to conceal their capture and dealings with the Black Eagles from Governor Nighthill. Soren questioned whether they should obey Aldous’s warning or resist. Eru cautioned that defying such a powerful mercenary force would be suicide, while Astaroth refused to serve them. Soren and Advenssax argued they might have no choice. Asteria interrupted sharply, declaring she would rather die than aid the men who destroyed her home. When Eru asked for clarification, she whispered that it was the Black Eagles who razed her family estate. Eru, visibly shaken, swore never to assist them either.\n\nLater, Leosin awoke, confused about his surroundings. The party reassured him that he was safe and bound for Greenest. To their surprise, the monk scolded them for rescuing him, explaining that his capture had been part of his mission to gather intelligence. The group countered that his crucifixion had not seemed part of the plan. Leosin revealed that Frulam Mondath recognized him — a revelation that silenced everyone. When pressed, he mentioned a date: the 17th of Flamerule, 1488 — a detail that startled Soren, who remembered attending a masquerade in Waterdeep that very night. Leosin admitted that Frulam was aware of his investigation into the Cult’s upper ranks but shared little more.\n\nFrustrated by his evasive answers, Soren lashed out, drawing a dagger to the monk’s throat before being restrained. To ease the tension, Advenssax revealed his metallic heritage by showing his true scales, convincing Leosin they were not cultists. Once calm, Leosin confirmed he was indeed a member of the Harpers and acknowledged the group’s bravery. He corrected their report about Lennithon’s flight path, circling a distant valley within the Sunset Mountains on their map. Eru, realizing that his own master had traveled there, grew pale when Leosin stated that Nymmurh was likely dead. Eru demanded answers about what danger lay in the valley, but Leosin’s only response was cryptic: ‘Balance has been broken.’\n\nThe group argued fiercely — Eru questioning whether portals to Avernus could exist there, and Astaroth warning him to drop the topic. Magic flared as a bolt of energy narrowly missed, tension crackling in the air. In the chaos, Advenssax accidentally mentioned the secret ‘deal’ with the mercenaries, forcing Soren to create loud noise magic to drown it out. Later that night, they held a secret council and shared their strange visions. Leosin listened carefully, explaining the possible causes — the ‘Three Ps’: Possession, Prediction, or Premonition — and warned them that whoever or whatever was behind it could not be ignored."
  },
  {
    "session": 10,
    "chapter": 2,
    "title": "Return to Greenest",
    "date": "1st–3rd of Tarsakh",
    "characters": [
      "Eru",
      "Advenssax",
      "Asteria",
      "Soren",
      "Astaroth",
      "Leosin",
      "Escobert",
      "Nighthill",
      "Sir Polaris II",
      "Markguth"
    ],
    "summary": "The group returns to Greenest with Leosin and delivers their report to Governor Nighthill. Despite hiding the truth about their deal with the mercenaries, they are offered a new mission — to recover a dragon egg from the Cult’s abandoned camp. Visions of dark caverns and living flesh pillars haunt them once again.",
    "full_text": "The journey back to Greenest was uneventful, and the group was greeted by the Knights of Lathander upon arrival. Escobert welcomed them warmly, arranging rooms and a banquet while awaiting Governor Nighthill. When Nighthill arrived, the adventurers presented their report — omitting their capture and the details about the dragon’s true destination. Soren made sly jokes about the omissions while exchanging tense stares with Sir Polaris II.\n\nAfterward, the group was offered rest: most chose to stay in the fortress, while Astaroth sought solitude at the Traveler’s Rest Inn, owned by Bruno Banks and his daughter, Jasmine. Bruno expressed gratitude for Astaroth’s deeds, unaware of their full scale. Kamir, his loyal steed, was well cared for. The others relaxed at the keep, finally enjoying peace and security.\n\nThe next morning, the companions spent their free time differently — Astaroth writing quietly, Asteria shopping through the recovering town, Advenssax training with Sergeant Markguth, Eru wandering in search of someone unseen, and Soren heading to meet Astaroth at the inn. Over tea prepared by Jasmine, Soren confessed his regret for past actions, explaining his ignorance of Astaroth’s culture. The tiefling compared him to a lemure from Avernus, prompting laughter. Soren swore he would not repeat his mistakes and hoped to mend the group’s bond. Astaroth told him reconciliation depended on Soren mediating peace with Eru. In thanks, Soren handed over a magical book, which reacted instantly to touch, revealing new runes and causing him to shatter the teacups in excitement. Bruno hurried in, only to be reimbursed — though not without a subtle intimidation from Soren.\n\nSoon after, guards summoned them all to the council room, where they encountered Leosin departing. He warned them not to underestimate dragonborn and invited them to visit his home. Inside, Nighthill revealed that Leosin had reported the Cult’s retreat from their encampment, likely abandoning it to avoid pursuit. Seeing opportunity, the Governor tasked the adventurers with retrieving one of the dragon eggs from the infirmary, promising a reward of one thousand gold pieces. During the meeting, however, the group suffered another intense headache — a shared vision of a massive, fleshy pillar crawling through a dark cavern before turning to stone beside a faintly glowing dragon egg. They hid their discomfort, accepted the mission, and left the room.\n\nOutside, Sir Polaris II stopped them, warning against the Governor’s plan. ‘No one can steal from the Cult without drawing their wrath — or the dragons’ themselves,’ he cautioned. Before departing, he invited them to visit his mentor, Kelddath Ormlyr, High Priest of the Song of the Morning Temple and Governor of Beregost."
  }
]