[
  {
    "session": 43,
    "chapter": 8,
    "title": "Carnath Roadhouse",
    "date": "13th–16th of Kythorn",
    "characters": [
      "Timoth Eyesbright",
      "Grizzelda Copperwraught",
      "Vangol Kuskolt",
      "Bog Luck"
    ],
    "summary": "The group, accompanied by Timoth, travels toward Carnath Roadhouse to face the black dragon Voaraghamanthar. After securing mounts from Leilon’s leader, Grizzelda, and striking a deal with a dwarven merchant, they arrive at Carnath and launch a surprise assault against the Lizardfolk guarding the outpost.",
    "full_text": "With preparations made for their impending clash against the black dragon **Voaraghamanthar**, the adventurers set their course northward, joined by their steadfast ally **Timoth Eyesbright**. Their destination: the decrepit trade post known as **Carnath Roadhouse**, rumored to serve as one of the Cult of the Dragon’s supply lines.\n\nThe road is long and weary, and as they approach **Leilon**, the group debates the practicality—and morality—of stealing beasts of burden to hasten their journey. **Soren**, unwilling to resort to theft, proposes a diplomatic alternative: speaking directly with the town’s leader, **Grizzelda Copperwraught**.\n\nInside Leilon’s modest hall, Grizzelda listens intently as Soren presents their cause, detailing the threat of the Cult and their mission against the black dragon. His silvered tongue and sincerity sway her judgment. With a stern but trusting nod, Grizzelda agrees to aid the party, granting them several strong **pack mules** to assist in their travels. The group departs the city with new mounts and renewed resolve.\n\nBefore leaving, a stocky dwarf named **Vangol Kuskolt** approaches them near the edge of town. His beard is neatly braided, his voice low but persuasive. “I’ve got an offer for heroes such as yourselves,” he begins, revealing a **pearl imbued with the spell Heroes’ Feast**, capable of granting divine fortitude before any great battle. In exchange, he asks them to **capture an elf named Dralmorrer**, a member of the fanatical cult **Eldreth Veluuthra**, whose goal is nothing less than the **extermination of humankind**. The group notes the request but keeps their focus on Carnath—for now.\n\nDays later, after a long march through rain-soaked swamps, the adventurers reach the outskirts of **Carnath Roadhouse**. The place reeks of rot and mildew, its walls half-collapsed, and eerie lights flicker from within. Timoth stops and gazes at the structure, the wind rustling through his mane. “Before we fight together,” he says, “I want to see how you move—how you strike. Show me your worth.”\n\nTaking his words as a challenge, the group scales the roof under cover of dusk, creeping into position above the reptilian sentries that guard the compound. A signal from Soren, a whisper of arcane power from Eru, and chaos erupts. **Lizardfolk warriors** swarm from the shadows, their guttural hisses echoing through the marsh, but the adventurers hold firm. **Advenssax’s axe carves through scaled flesh**, **Astéria’s arrows pierce from the dark**, and **Soren’s melodies weave through battle like fire and wind**. Timoth watches, impassive yet impressed, as the group dismantles the enemy formation with discipline and fury.\n\nWhen the final Lizardfolk falls, silence returns to the fetid air. The Roadhouse lies in ruins, its defenders slain, and the path ahead—to Voaraghamanthar’s domain—stretches wide open. Timoth nods solemnly. “You fight as one,” he says. “Perhaps there’s hope for this coast after all.”"
  },
  {
  "session": 44,
  "chapter": 8,
  "title": "Surviving the Black Death",
  "date": "17th of Kythorn",
  "characters": [
    "Voaraghamanthar",
    "Waervaerendor",
    "Timoth Eyesbright"
  ],
  "summary": "The group faces Voaraghamanthar’s deadly ambush at Carnath. Exhausted after waves of undead and relentless battles, they endure against both black dragons, surviving through strategy, aid from Szarr, and sheer willpower.",
  "full_text": "In Carnath, the group celebrates its 'easy' victory over the Lizardfolk, but the joy is short-lived. The Black Death, Voaraghamanthar, descends upon them earlier than expected. The heroes scramble to prepare, consuming precious potions of resistance as the dragon attacks with an army of undead. Despite the brutality of the fight, they strike the dragon and fell his undead minions — only to realize the assault was merely a ploy. Voaraghamanthar retreats, promising to return in an hour — and he keeps that promise.\n\nWeakened and with their resources drained, the group braces for another clash. The dragon returns, revealing his secret — he is not Voaraghamanthar, but his twin brother, Waervaerendor. Together, they are the true Black Death of legend. The second assault leaves the heroes battered, and their exhaustion deepens when wave after wave of undead sweep the battlefield. The group fights through two relentless waves, barely standing by the end.\n\nDesperate, they reach out to Szarr for aid, and Timoth proposes using Mammon’s shop to secure supplies on credit, invoking Astaroth’s word as a guarantee. As they regroup, a new horror appears — a dark knight on horseback offering surrender in exchange for survival. Soren refuses, striking first, and the knight is slain in another grueling fight.\n\nBut the dead do not rest. The final onslaught begins — both black dragons now united, bringing the full force of their wrath. Timoth and Advenssax take to the skies under invisibility, striking first, but Timoth falls, leaving chaos below. Szarr’s vampires arrive just in time, helping to thin the undead ranks. Against all odds, the group prevails again, driving back the twin dragons. Though victory is theirs, it is hollow and weary — their bodies broken, their will tested, but their spirits unyielding as they finally rest and prepare for what comes next."
  },
  {
  "session": 45,
  "chapter": 8,
  "title": "The End of the Black Death",
  "date": "17th of Kythorn",
  "characters": [
    "Voaraghamanthar",
    "Waervaerendor",
    "Timoth Eyesbright"
  ],
  "summary": "Guided by Raulothim’s warning, the group learns the twin black dragons are attempting to summon Ebondeath, the ancient dracolich. Racing through the swamp, they strike before the ritual completes, defeating both dragons and ending the Black Death once and for all.",
  "full_text": "The group rests under the protection of Szarr’s vampires, recovering from their brutal encounters. But peace is fleeting. Paimon, who has been tracking the twin dragons, urgently awakens Astaroth — something sinister is unfolding in their lair. At the same time, every member of the party feels a stabbing pain in their heads, a familiar echo of the visions that have haunted them, though this time no image follows.\n\nSuspecting a divine interference, Astaroth, Eru, and Soren remove their amulets of protection against divination, allowing Raulothim to finally reach them. The amethyst dragon’s telepathic voice trembles with urgency: Voaraghamanthar and Waervaerendor are attempting to summon Ebondeath — the Black Dread, an ancient dracolich erased from mortal records by Myrkul himself out of envy for its destructive might. Once known as Chardansearavitriol, Ebondeath ascended beyond mortality by fusing with the Cult of the Dragon more than five centuries ago, achieving unholy immortality.\n\nRaulothim warns that if the ritual succeeds, it could spell the end of the Sword Coast. He urges them to investigate the mysterious Castle Naerytar after stopping the ritual, as its ties to the cult’s greater plan seem undeniable. The heroes waste no time — pushing through the fetid swamps toward the dragons’ lair.\n\nThere, beneath the stench of decay and the crackling hum of necrotic power, the group launches a coordinated strike. Channeling every remaining ounce of strength and with Timoth leading the charge, they disrupt the summoning circle moments before its completion. The twin dragons, caught mid-ritual, are overwhelmed by the group’s assault. The battle is fierce but decisive — both Voaraghamanthar and Waervaerendor fall, their corrupted souls dissolving into the mist.\n\nAs silence settles over the swamp, the group stands victorious at last. The Black Death has ended. Yet among the riches of the dragons’ hoard lies the shadow of a greater mystery — one that leads straight to Naerytar."
  }  
]
