[
    {
  "session": 50,
  "chapter": 11,
  "title": "Journey to the Flying Castle",
  "date": "20th of Kythorn",
  "characters": [
    "Glazhael"
  ],
  "summary": "The group makes two attempts to reach the flying castle. After their first plan fails during an aerial confrontation with the white dragon Glazhael, they succeed in their second attempt by infiltrating inside a Bag of Holding. They land unnoticed and discover a hoard of stolen treasure within the fortress walls.",
  "full_text": "Reaching a flying fortress in the sky proved to be far more dangerous than expected. The first plan involved creativity and risk: Astéria was transformed into a cockroach and stored inside Soren’s pocket, while Soren summoned Seiya the Pegasus to carry Astaroth. Eru and Advenssax took to the skies atop a conjured dragon. Their ascent was immediately challenged by Glazhael, the white dragon and master of Talis the White. Furious and bloodthirsty, he launched a fierce aerial assault.\n\nMagic burst through the freezing winds as the group pushed back the dragon’s wrath. Though they managed to wound Glazhael, he retaliated by destroying their mounts — leaving the party stranded in the open skies with no viable way to reach the fortress. Forced to abandon the assault, the group retreated before disaster struck.\n\nOn the ground, they quickly regrouped. After a brief rest, Nym Storm devised a second, more discreet plan: all members entered the Bag of Holding. Under invisibility, Seiya and Paimon carried the bag toward the drifting castle. Glazhael nearly detected them, the difference hanging by a single breath — but the stealth effort succeeded.\n\nThe party safely landed aboard the massive fortress. At first glance, the structure revealed what lay at the heart of its purpose: chambers overflowing with glittering treasure — the spoils of ravaged settlements collected for a dragon’s greed. The group suspected this flying castle was none other than the lair of Glazhael himself — though what awaited them deeper inside remained a mystery."
    },
    {
  "session": 51,
  "chapter": 11,
  "title": "The Death of the Star Song",
  "date": "20th of Kythorn",
  "characters": [
    "Glazhael",
    "Captain Othelstan"
  ],
  "summary": "While exploring the flying castle, the group is ambushed by overwhelming forces of the Cult of the Dragon. Captain Othelstan strikes a fatal blow against Soren, fulfilling his grim prophecy. The party escapes with Soren’s corpse, retreating to Baldur’s Gate.",
  "full_text": "With the stolen treasure of countless settlements glimmering behind them, the group continued deeper into the icy caverns of the flying fortress. Suddenly, the castle lurched with a tremendous impact — and the entrances sealed under thick walls of frozen magic. Trapped, they ventured upward.\n\nA terrified ogre was the first sign of danger. It fled up a staircase only to be cornered, and as the party climbed after it, they emerged into a war camp of the Cult of the Dragon — ogres and stone giants alike gathered within the keep. The giants claimed neutrality, calling themselves mere guests, but battle erupted regardless.\n\nDespite an early advantage, everything changed in an instant.\n\nCaptain Othelstan descended from above riding a wyvern, leading a surprise assault that struck directly at the most vulnerable members of the group. Panic followed. Pain followed. Blood followed.\n\nAmid chaos and desperate spellcasting, the prophecy long tied to the God Who Crawls took form: Othelstan’s flail spun like a comet, and with one dreadful impact, Soren’s skull was crushed — his head shattered in an explosion of bone and starlight. The bard’s song was silenced.\n\nGrief drowned strategy. Victory turned to terror.\n\nCarrying the remains of their fallen companion, the survivors fled into the depths of the cavern. With one final desperate act, they used a teleportation scroll — ripping themselves away from the castle and reappearing in Baldur’s Gate.\n\nTheir victory was not survival.\nIt was escape.\nAnd it tasted like ash."
    },
    {
  "session": 52,
  "chapter": 11,
  "title": "First Book's Ending",
  "date": "21st of Kythorn",
  "characters": [
    "Alicia",
    "Keene Nine-Fingers",
    "Isolda 'Thunder Spear'"
  ],
  "summary": "To be added.",
  "full_text": "To  be added."
    }
]