[
  {
    "session": 14,
    "chapter": 4,
    "title": "On the Road!",
    "date": "10th-14th of Tarsakh",
    "characters": [
      "Escobert",
      "Markguth",
      "Lia",
      "Hozorlig",
      "Elemmírë"
    ],
    "summary": "The group begins their journey to Berdusk, joined by Lia and Hozorlig. On the road, they meet Elemmírë and fight Cult of the Dragon bandits. Suspicion arises that Governor Nighthill may have ulterior motives behind their dangerous missions.",
    "full_text": "Before setting out on their long journey, the group receives words of inspiration from Escobert, who recites a poem for their departure. Lia and Hozorlig decide to accompany them as far as Elemmírë. During the trip, Hozorlig tells the story of the Avowed, Candlekeep's monastic order, and the prophet Alaundo, whose endless song foretells Faerûn’s destiny. Lia remarks that hearing this story is an honor few ever receive. As the road quiets, discussions turn to patrols along the Greenest–Berdusk road, hinting at new political alliances and Nighthill’s possible choice to side with Amn over Elturgard. Later, the group encounters Elemmírë battling Cult of the Dragon members and defeats them easily. Doubts about Nighthill’s motives grow—was his refusal of Elturgard’s aid based on greed, fear, or manipulation from Baldur’s Gate? Hozorlig shares the tale of Escobert earning the title ‘The Red’ after slaying traitors, and the group suspects Nighthill’s missions may have been suicidal by design. The Jett Squadron decides to join them in Berdusk to regroup and plan their next steps."
  },
  {
    "session": 15,
    "chapter": 4,
    "title": "Berdusk!",
    "date": "15th of Tarsakh",
    "characters": [
      "Lia",
      "Hozorlig",
      "Elemmírë",
      "Grion Ventoleste",
      "Olbrimsur Thunderwood",
      "Carlton Swiftwind"
    ],
    "summary": "Arriving in Berdusk, the group sells their spoils and meets new allies, including merchants Grion Ventoleste and Olbrimsur Thunderwood. At the Running Stag Inn, they meet Carlton Swiftwind, who delivers a letter from Leosin urging them to reach Elturel.",
    "full_text": "After days of travel, the group finally reaches Berdusk. Seeking to sell their wagonload of arms, they are guided by the Jett Squadron to local traders. They meet Grion Ventoleste, an acquaintance of Advenssax, who directs them to the enigmatic merchant Olbrimsur Thunderwood. Olbrimsur purchases their entire stock for a fair price and engages each in personal conversation—discussing Eru’s arcane ambitions, Astéria’s stealth, and Soren’s curiosity. With their burdens lifted, the group visits the elegant Running Stag Inn, home to Carlton Swiftwind, brother of Charles. While the group’s manners clash with the refined establishment, Astaroth challenges Eru and Advenssax to a drinking contest. Eru triumphs, leaving Astaroth unconscious and Advenssax barely standing. Amid laughter and recovery, Carlton greets them warmly and delivers a sealed letter from Leosin—an urgent call to reach Elturel. Carlton, aware of Leosin’s ties to the Harpers, offers aid to the party, while Eru boldly requests an audience with the Grand Duchess. The group settles in the inn, though Astaroth slips away toward a shady tavern, Hullybuck’s Gamble."
  },
  {
    "session": 16,
    "chapter": 4,
    "title": "Individual Freedoms!",
    "date": "15th of Tarsakh",
    "characters": [
      "Carlton Swiftwind",
      "Olbrimsur Thunderwood",
      "Madam Padva",
      "Frederik"
    ],
    "summary": "Soren and Astéria attend a grand performance at the College of Doss, while Eru deceives Lia with a romantic ruse. New bonds form, and the day ends with reflection and intrigue.",
    "full_text": "After their meeting with Carlton, the group goes separate ways. Soren and Astéria accept Olbrimsur’s invitation to the College of Doss for a theatrical performance, but first visit Padva’s Atelier to acquire proper attire. Meanwhile, Eru deceives Lia, sending her to a park under the pretense that Soren awaits her for serious discussion—only for Eru, disguised as Soren, to confess his feelings and steal a kiss, urging her to keep it secret. Soren and Astéria, elegantly dressed, meet Olbrimsur and Madam Padva at the college and attend the epic play of Hill’s Edge, an evening of art and emotion marking a calm before the storm of what’s to come."
  },
  {
  "session": 17,
  "chapter": 4,
  "title": "Difficult Decisions",
  "date": "16th of Tarsakh",
  "characters": [
    "Cylyria Dragonbreast",
    "Olbrimsur Thunderwood",
    "Carlton Swiftwind",
    "Captain Halvard"
  ],
  "summary": "The group meets with Olbrimsur, who warns them about the Cult of the Dragon’s possible attack on Hill’s Edge. After receiving tempting offers and warnings, they meet Cylyria Dragonbreast, where Astaroth is exposed as a Zhentarim agent.",
  "full_text": "At dawn, the group receives a message from Olbrimsur requesting their presence in his shop. Brim explains that, based on what they shared, the Cult of the Dragon may be targeting Hill’s Edge. Soubar lies much farther north, but the cult would have to pass through Berdusk, allowing Olbrimsur to warn the group in time. He insists that the six-day difference in travel could prove fatal for Hill’s Edge. Brim promises sponsorship and generous rewards if the group hunts down the werewolves in the forest, offering political influence and favor from three major cities. Astéria adds that her cousin and uncle are in Hill’s Edge and could be in danger.\n\nThe group decides to act quickly, sealing a deal with Captain Halvard to travel at full speed. Along the way, Eru gifts everyone copper-dragon medallions to symbolize their unity as a group. Before departing, they attend an audience with Cylyria Dragonbreast, who commends their deeds. Eru proves her connection to Nymmurh, while Advenssax straightforwardly asks about a faster way to reach Hill’s Edge. Cylyria denies such means. When Astaroth awkwardly refers to Leosin as a ‘harp player,’ Cylyria feels insulted and psychically probes him—only to uncover his hidden allegiance: Astaroth is Zhentarim."
  },
  {
    "session": 18,
    "chapter": 4,
    "title": "Astaroth’s Judgment",
    "date": "16th of Tarsakh",
    "characters": [
      "Cylyria Dragonbreast",
      "Carlton Swiftwind",
      "Captain Halvard"
    ],
    "summary": "After Astaroth’s identity as a Zhentarim agent is revealed, he faces Cylyria’s interrogation but manages to justify himself. The group then departs toward Hill’s Edge, finding the city under attack.",
    "full_text": "Following Astaroth’s exposure, Cylyria demands an explanation. He defends himself, claiming that his actions define him—not his organization. Cylyria attempts to read his mind again but fails. After reflection, she allows him to live, ordering a full report after their meeting with Leosin. As the group walks back to the Running Stag Inn, Astaroth explains his side, while Eru condemns his choices and Astéria seethes with anger. They soon depart with Captain Halvard for Hill’s Edge. The journey is uneventful, filled with light-hearted chatter until they arrive to find the city engulfed in chaos—Gnolls storming through, killing guards and civilians alike."
  },
  {
    "session": 19,
    "chapter": 4,
    "title": "The Battle of Hill’s Edge Begins",
    "date": "22nd of Tarsakh",
    "characters": [
      "Velarian Alferant",
      "Joybringer Caseldown (Song Dragon)"
    ],
    "summary": "The group arrives in Hill’s Edge and helps defend the city from a massive Gnoll assault. Velarian Alferant joins the battle heroically but is struck down by a poisoned attack.",
    "full_text": "Upon entering Hill’s Edge, the group swiftly engages a wave of Gnolls at the gates, saving several guards. They instruct a soldier to alert Captain Halvard while they push further into the city. After cutting down more Gnolls, they encounter familiar faces near the Montgomery residence, relatives of Astéria. The brief reunion gives way to another skirmish, with the group moving toward a large temple overrun by Gnolls. Soren rashly enters a suspicious house, alerting all enemies nearby and forcing the team into a defensive position.\n\nThe group and temple guards fight back against the horde. When the situation grows dire, a knight arrives: Velarian Alferant, charging in on horseback with reinforcements. His presence turns the tide of battle—until two riders on Wyverns descend from the sky, ambushing him. Velarian is gravely injured and poisoned. At that moment, Joybringer Caseldown, the temple’s cleric, reveals her true nature as a Song Dragon, taking to the skies to battle the Wyverns herself."
  },
  {
    "session": 20,
    "chapter": 4,
    "title": "The Fall of Velarian Alferant",
    "date": "22nd of Tarsakh",
    "characters": [
      "Velarian Alferant",
      "Joybringer Caseldown (Song Dragon)"
    ],
    "summary": "The Wyverns are defeated, but Velarian’s poisoning leaves him on the brink of death. The group learns the antidote’s ingredients lie deep in the Forest of Sharp Teeth.",
    "full_text": "As the Song Dragon clashes with the Wyverns, the guards and the group deal with Gnoll archers hidden in nearby buildings. The combined efforts bring victory, but the cost is high—Velarian lies dying, poisoned by a rare and potent venom. The Song Dragon identifies the cure’s components, all of which grow within the Wood of Sharp Teeth. Astaroth mentions he knows an alchemist in Baldur’s Gate who could craft the antidote if given the ingredients. After heartfelt words with the Song Dragon, the group leaves Hill’s Edge, bound for Elturel and new plans."
  },
  {
    "session": 21,
    "chapter": 4,
    "title": "At Last, Elturel",
    "date": "23rd–26th of Tarsakh",
    "characters": [
      "Captain Halvard",
      "Leosin",
      "Ontharr Frume"
    ],
    "summary": "On their rushed voyage to Elturel, the group faces tragedy and revelations. Halvard is poisoned by accident, and the group meets Leosin and Ontharr Frume, uncovering truths about the Cult of the Dragon and the Order of the Gauntlet.",
    "full_text": "The journey to Elturel is frantic—Halvard pushes his crew to their limits as the group faces haunting visions of heat, fire, and steel shaping unknown artifacts. During the voyage, Eru carelessly lets Halvard handle the venom sample, resulting in the captain accidentally poisoning himself. The group races against time to reach Elturel, where Eru finds a cleric to delay the poison’s effects.\n\nMeanwhile, the rest meet Ontharr Frume, who introduces himself as the regional leader of the Order of the Gauntlet. He and Leosin discuss recent cult movements, the increasing boldness of the Dragon Cult, and their attempts to locate its base—the Well of Dragons, a volcanic stronghold. The group’s shared visions lead Leosin to hypothesize connections to old ruins and divine interference. As preparations for the next leg begin, he reveals a teleportation circle in Hornhollow that could drastically shorten their next journey."
  }
]