[
  {
    "session": 22,
    "chapter": 5,
    "title": "Satyr Revelry",
    "date": "27th–29th of Tarsakh",
    "characters": [
      "Ritchie",
      "Olin",
      "Panor",
      "Theron"
    ],
    "summary": "In Hornhollow, the group meets Olin, who warns of hooded men entering the Sharp Teeth Woods — suspected Cult of the Dragon agents linked to a terrifying Dracohydra. Ignoring Olin’s advice to stay out, the group ventures in, meets satyrs who test them for lycanthropy, and joins their raucous celebrations before learning the location of the beast’s lair.",
    "full_text": "Upon arriving in the quiet village of Hornhollow, the group meets Olin, the village leader. He explains that for several tendays, hooded men have been seen entering and leaving the nearby forest at strange hours, using secluded paths. Olin suspects they might be agents of the Cult of the Dragon and possibly responsible for sightings of a massive, many-headed creature lurking within the forest — a Dracohydra. He warns the group not to enter the woods under any circumstances, but, true to their nature, they disobey moments later.\n\nWith preparations made, weapons ready, and spirits high, the party ventures into the dense, seemingly endless expanse of the Sharp Teeth Woods. The first days are monotonous, filled with shadows and indistinct whispers carried by the wind, until they find faint tracks leading deeper into the wilderness. Choosing to follow them, they eventually stumble upon a group of satyrs — Panor, Theron, and others — who stop them and demand a test to prove none of them are lycanthropes. Each member complies, and once trust is earned, the mood shifts dramatically.\n\nSoon, the clearing is alive with music and laughter. Wine flows freely, and the night becomes one of reckless celebration — dancing, stories, and temptation blending under Feywild starlight. Between songs and laughter, the satyrs reveal what the group sought: the rumored lair of the Dracohydra lies deep within the forest, beyond the edge where sound itself seems to die. As the revels end and dawn begins to glow through the treetops, silence falls once again. The forest is still, and even the animals have fled. The group steels themselves, knowing their next encounter will be with a monster born of dragons — a creature of pure chaos and hunger."
  },
  {
    "session": 23,
    "chapter": 5,
    "title": "Dracohydra",
    "date": "29th of Tarsakh",
    "characters": [
      "Ritchie"
    ],
    "summary": "The group finally faces the creature haunting Hornhollow — a terrifying Dracohydra. After an exhausting battle that nearly costs their lives, they are ambushed by Valarken’s werewolf mercenaries. Ritchie reveals the truth about Valarken’s past: once a duke of Baldur’s Gate, now the cursed leader of the Red Moon pack.",
    "full_text": "At last, the group comes face to face with the terror plaguing Hornhollow. None of the villagers had ever dared to approach the ruins, and those who tried never returned. Within the crumbling stone halls, the truth is revealed: a Dracohydra — a monstrous fusion of dragon and hydra, its many heads snapping and hissing in a maddening chorus.\n\nThe battle that follows is brutal and seemingly endless. Each time the creature’s heads are severed, new ones sprout, more vicious and stronger than before. Ritchie and Soren provide constant support to keep the others alive, their healing and coordination holding the line. Eru and Astaroth unleash powerful bursts of arcane energy, burning and blasting the monster, while Astéria and Advenssax deliver crushing blows that shake the ruins themselves.\n\nWhen the final head falls and the Dracohydra collapses into silence, the group barely has time to breathe. From the shadows emerge new foes — werewolves, led by none other than Valarken himself. His orders are clear: kill the Nym Storm group. The ambush is chaotic, with Soren attempting to reason with the lycanthropes, invoking Valarken’s name, but to no avail. Steel and claw clash under the pale moonlight, and by miracle, no one is bitten. When the last of the attackers falls, Ritchie takes a deep breath and reveals what he knows.\n\n“In Baldur’s Gate,” he begins, “there was once a rebellion over unjust taxes. Merchants were hunted, the poor revolted, and the city nearly fell apart. The crisis ended when the people demanded four dukes to govern equally. But among them was Valarken, who twenty years ago tried to kill his fellow dukes. Only Dillard Portyr survived. After the failed coup on the 25th of Kythorn, 1470, Valarken fled with his mercenaries. If this is truly him, then we face not just a murderer — but a former duke and the leader of the Red Moon pack. And if he commands werewolves, then he too must be cursed.”\n\nThe revelation chills the group. The cult’s ties to Baldur’s Gate run deeper than imagined. Knowing Valarken and his lycanthropes still lurk within the woods, the party rests briefly, then continues deeper into the forest — toward new dangers, and an inevitable confrontation. Their journey stretches through the 30th of Tarsakh and into Greengrass, the spring festival marked not by peace, but by the scent of blood and silver in the air."
  },
  {
    "session": 24,
    "chapter": 5,
    "title": "Ruins of Vehlarr",
    "date": "1st of Mirtul",
    "characters": [
      "Ritchie",
      "Valarken",
      "Sszaczverack"
    ],
    "summary": "The group explores the ancient ruins of Vehlarr, uncovering Valarken’s plans and clashing with both his Red Moon pack and a force of draconians. The battle ends with Eru and Advenssax cursed with lycanthropy, and shocking revelations about Advenssax’s brother, Exiressax — a Blue Dragon Mask Wearer and servant of Tiamat.",
    "full_text": "Delving into the ancient ruins of Vehlarr, the group ascends toward a crumbling ziggurat. Amidst the silence, they spot a massive wolf sleeping near the altar — vulnerable, or so it seems. Before anyone can strike, Eru, unusually cautious, heightens his arcane senses and perceives movement all around. They are surrounded. The ambush is sprung, and the night explodes with howls and the clash of steel.\n\nThe battle rages fiercely within the moonlit ruins. Eru unleashes his full power, blasting through waves of enemies without restraint. The rest of the party fights tooth and claw, and against all odds, the group emerges victorious — no one is bitten, though the echoes of mourning howls from higher up reveal that Valarken’s Red Moon pack has suffered heavy losses.\n\nSeeking to locate their enemies, Ritchie drinks a potion of Clairvoyance, granting him sight and hearing for a mile around. Through the divine vision, he spies Valarken himself — furious and pacing within another section of the ruins. The werewolf lord curses his lieutenants, demanding answers for the Dracohydra’s failure and the slaughter of half his pack. One of his followers hesitantly explains: ‘We didn’t anticipate another member in their group.’\n\nThe revelation confirms the worst — the enemy knows they’re coming. Before long, the ruins become the stage for a chaotic three-way battle: Nym Storm against Valarken’s Red Moon werewolves and a contingent of draconians.\n\nThe fight is grueling, each side clashing under the light of the rising moon. In the heat of the chaos, Eru performs a desperate spell, transforming Advenssax into a massive, armored crab to save his life. Even so, not all escape unscathed — both Eru and Advenssax are bitten, contracting the dreadful curse of lycanthropy.\n\nAs the dust settles, the last surviving draconian utters a chilling truth before dying: ‘Exiressax, Wearer of the Blue Dragon Mask — Dragonborn brother of Advenssax, Cleric of Task and Astilabor, devoted servant of Tiamat.’\n\nSilence falls over the ruins. The group gathers their breath beside the ancient portal carved into the stone. Soren stands before it, waiting for the full moon to reach its zenith and open the way to Feywild. Eru paces nervously, while Astaroth and Advenssax rest with Astéria. Paimon, ever mischievous, makes jokes to lighten the heavy air.\n\nRitchie, however, sits apart, weary and solemn. When he finally speaks, his words weigh heavy: ‘Every fifty years, a new generation of warriors is called to defend Feywild. My father, Richard, abandoned that duty, and countless lives were lost. Only the intervention of Selûne herself stopped the massacre. For his betrayal, he was branded a traitor and banished. Now, I must atone for his sins.’ He then reveals another secret — Olbrimsur Thunderwood, their ally, is one of the Argent Hunters involved in that tragedy.\n\nBefore taking his leave, Ritchie entrusts the group with four scrolls and a message to deliver to his superiors: that Richard II fought to cleanse the sins of his father. With that, he bids farewell — a weary exile seeking redemption, as the moonlight begins to shimmer upon the dormant Feywild portal."
  },
  {
    "session": 25,
    "chapter": 5,
    "title": "Entrance to Feywild",
    "date": "2nd–4th of Mirtul",
    "characters": [
      "Richard II (Ritchie)",
      "Sszaczverack (Deceased)"
    ],
    "summary": "Before entering the portal to Feywild, the group interrogates a dead draconian, learning about Rezmir the Black and the Wyrmspeakers. Once inside Feywild, illusions trap them in a witch’s house, leading to a deadly fight and bizarre encounters with trickster Boggles.",
    "full_text": "Just before stepping into the shimmering portal to Feywild, the group takes a final moment to interrogate the corpse of the slain draconian. Through magic, they extract five key answers: he doesn’t know where Naerytar is; Rezmir the Black is a black dragonborn from House Orogoth and a Wyrmspeaker of the Cult of the Dragon; Wyrmspeakers hold the highest rank within the cult; Exiressax, Advenssax’s brother, is heading to meet Rezmir; and finally, when asked if he has any romantic ties, he bluntly answers ‘no.’\n\nWith this cryptic knowledge in hand, the group steps through the portal—and their minds are immediately assaulted by terrifying visions of their pasts. Darkness consumes their senses, and when they awaken, they find themselves in what appears to be a cozy cottage in Feywild. Towels are neatly folded, the air smells of flowers, and fresh food awaits them on a table. But something feels wrong. Drac and Paimon are missing, and Eru’s anxiety grows by the second.\n\nAt first, Soren tries to keep his composure, determined to rest while they wait for their mysterious hostess to return. The others, however, can’t shake their unease. The doors are locked. The windows are sealed. When Advenssax’s impatience gets the better of him, he swings his axe at the walls—shattering an illusion that instantly dissolves into horror.\n\nThe idyllic cottage transforms into a rotting hovel. The food is infested with maggots, the air reeks of decay, and the once-inviting bathwater is thick, dark, and crawling with insects. Those who touched it—Soren, Eru, Advenssax, and Astéria—fall ill almost immediately. Before they can recover, the true owners of the house return: a coven of nightmarish hags.\n\nThe ensuing battle is brutal and chaotic. Nym Storm faces the witches at a heavy disadvantage, fighting through hexes, curses, and illusions. One by one, the hags fall, their screams echoing through the Feywild. When the dust settles, the group scavenges what little they can from the ruined cabin, but there’s no time to rest—outside, Soren’s magical tome stirs to life. Its pages turn of their own accord, revealing ancient and cryptic lore about the Feywild, new paths, and hidden truths.\n\nFollowing this revelation, the group presses onward until they reach a strange wooden bridge stretching over a foggy ravine. As they attempt to cross, disorienting illusions play tricks on their senses, until a small, grotesque creature materializes—a mischievous Boggle. The creature demands payment for passage: to slay a creature that had dared attack him during one of his pranks on a nearby Fomorian. Only then, he claims, would they be allowed to cross his bridge.\n\nThe group, weary and impatient, refuses to play along. With a mighty strike, Advenssax smashes a hole through the bridge, and they drop down to escape beneath it—only to find themselves face-to-face with two other Boggles. These lesser tricksters, subordinates of the first, offer a compromise: they will help the group cross safely, if the adventurers agree to deal with the same creature that angered their master.\n\nThe group accepts the bargain, ready to continue deeper into the whimsical yet perilous realm of Feywild."
  },
  {
    "session": 26,
    "chapter": 5,
    "title": "Arrival at Myth Lharast",
    "date": "5th of Mirtul",
    "characters": [
      "Elantra Moonlight",
      "Feena Archwood"
    ],
    "summary": "After defeating a Fomorian in the depths of Feywild, the group reaches the distorted yet majestic city of Myth Lharast. There, they are received by Captain Elantra Moonlight and face a difficult decision about curing or embracing their newfound lycanthropy under the guidance of the healer Feena Archwood.",
    "full_text": "After negotiating with the Boggles, the group sets out once more, guided toward a cavern said to house a fierce Fomorian. Deep within, the adventurers engage in a brutal battle with the grotesque giant, who lashes out with maddening magic, striking everyone at once and inflicting strange eruptions upon Advenssax’s skin. Despite the creature’s strength, it falls to Nym Storm’s combined might. When the dust settles, the group learns that this monster was no ordinary being—it was a Sentinel of Malabog, a guardian from the corrupted Kingdom of Malabog itself. The Boggles reveal that the coveted Will-o’-Wisp Flower can be found in the depths beyond, but the group, wary of further danger, chooses instead to head toward the fabled city of Myth Lharast.\n\nThe journey through Feywild is disorienting. Time feels fractured, and when they finally emerge from the trees, Myth Lharast rises before them—a breathtaking city shimmering through a distorted haze, as though seen through water. Towering spires twist with living vines and radiant moonlight, both beautiful and alien. As they step into the city, they are met by armored figures bearing the crest of Argentum—the Silver Knights. At their head stands Captain Elantra Moonlight, her presence regal and composed. She greets the adventurers curtly and quickly notices something amiss: two of them carry the taint of lycanthropy.\n\nA tense exchange follows. The knights, cautious but not cruel, prepare for confrontation until the group explains their circumstances. Elantra listens, her sharp eyes studying them, before declaring that the afflicted will be placed under quarantine for the city’s safety. A healer, she promises, will be sent to assess their condition. Thus, the group is escorted to a secluded house on the city’s outskirts, where they can rest and recover under watch.\n\nInside the quiet refuge, they finally exhale. Soren, ever the pragmatic one, uses Sending to contact Leosin, learning grim news: Velarian Alferant, poisoned during the battle of Hill’s Edge, has only six days left to live. Their respite is short-lived as the promised healer arrives—a serene elven woman named Feena Archwood. Her soft-spoken words carry divine weight as she explains the duality of their curse: lycanthropy is a tug-of-war between the goddesses Selûne and Shar. To accept Selûne’s light means embracing the beast and learning control; to reject it through a cure means ceding power to Shar, strengthening darkness for another cycle of bloodshed that will last fifty years.\n\nEru and Advenssax, burdened by the consequences of their choices, deliberate heavily. Soren and Astéria, meanwhile, converse with Feena about the Treants of Feywild, seeking knowledge for the tasks that lie ahead. When the time for decision comes, both afflicted heroes choose to reject their curse, allowing Feena’s ritual to purge the lycanthropy from their veins. The magic is pure yet sorrowful—Selûne’s light fades slightly from the city that night, and Shar’s influence grows.\n\nStill, there remains a flicker of hope. Feena confides that Ritchie’s return to Myth Lharast could restore balance to Selûne’s grace. She implores the group to summon him. At her request, Soren once again channels Sending magic, his voice crossing planes to reach their missing ally. Hope, fragile yet luminous, flickers anew within the moonlit city."
  },
  {
    "session": 27,
    "chapter": 5,
    "title": "The Forgotten King's Domain",
    "date": "5th of Mirtul",
    "characters": [
      "Karontor"
    ],
    "summary": "Delving into the depths of Malabog’s cavern, the group encounters the ancient god Karontor—the Banished Son, the Crawling King. A pact is forged between mortals and deity, binding them as his eyes and agents of vengeance against the All-Father.",
    "full_text": "After a much-needed rest in Myth Lharast, the adventurers resolve to continue their journey, setting out toward the cavern said to lead into the Kingdom of Malabog. The air grows heavy and damp as they enter, and the walls of the cave seem almost alive—pulsing faintly, slick with a strange substance, echoing with sounds that don’t quite belong to stone. As they press deeper into the fleshy tunnels, monstrous cyclopes emerge from the shadows, their single eyes gleaming with primal rage. The ensuing battle is brutal and exhausting, but with resilience and coordination, the group triumphs, leaving behind the massive corpses of their foes.\n\nFurther along, three distinct paths stretch into darkness. Choosing the narrowest, they proceed carefully until a curtain of fog appears before them. The mist swirls unnaturally, and as they step through, the oppressive pressure of divinity fills the air. Voices whisper in forgotten tongues, and a colossal silhouette forms in the haze. They have entered the domain of **Karontor** — the Banished Son, the Crawling King, the Forgotten One.\n\nKarontor’s voice seeps into their minds like venom and silk intertwined. He declares his hatred for **Annam All-Father**, the progenitor of the giant gods, and swears his desire to see **Ostoria**, the ancient empire of giants, utterly destroyed. His tone wavers between sorrow and wrath, and his words seem to twist reality itself. Yet his speech falters when Eru, steady and fearless, reveals that Ostoria has already fallen into ruin ages ago. The revelation silences the cavern, and then the god laughs—a slow, dreadful laugh that reverberates through bone and stone alike. Amused, Karontor rewards Eru for his honesty, gifting him a glimpse beyond mortal comprehension: a vision of **Nymmurh** seated upon a grand throne beside four other dragons within a colossal hall of stone crafted by giants. The image fades, leaving Eru breathless and shaken.\n\nA tense negotiation follows. Karontor offers a bargain: freedom from his dominion in exchange for servitude. He will see through their eyes, know what they see, and when the time comes, they will act as instruments of his vengeance. The price of disobedience is unspoken, but deeply understood. The group, weighing the futility of defiance, accepts the pact. Cold energy snakes through their minds as the god brands his mark upon their souls—an unseen chain linking their fate to his.\n\nKarontor offers them one final temptation: the chance to face his champion in combat to earn forbidden knowledge—the truth behind the mysterious visions plaguing them. But the group, recognizing their current weakness, refuses. The god does not take offense. Instead, his voice turns solemn, almost approving. He acknowledges their wisdom and warns them that they are not yet strong enough to release him from his imprisonment—but one day, they might be.\n\nAs the mist begins to recede, his final words echo in their minds: *“You have glimpsed eternity, and eternity has now glimpsed you. Walk carefully, children of Nym, for even gods remember.”*"
  },
  {
    "session": 28,
    "chapter": 5,
    "title": "Myconids",
    "date": "5th of Mirtul",
    "characters": [
      "Karontor",
      "Myconid Sovereign",
      "Deep Dragon"
    ],
    "summary": "After escaping Karontor’s domain, the group allies with a colony of myconids to slay a deep dragon and its army of spore zombies in exchange for the rare Will-o’-Wisp Flower.",
    "full_text": "Freed from the oppressive dominion of Karontor, the party takes a moment to breathe. The air still tastes of divine corruption, and Eru’s voice breaks the silence — he warns the others that his mind must never be invaded, that there are truths within him even gods should not touch. With that grim declaration, they return to the cavern network, choosing a path different from the one that led them to the Crawling King. The tunnels grow damper and richer with life — the scent of earth and decay fills the air until faint motes of light drift before them like spores suspended in water.\n\nBefore long, they find themselves surrounded by towering fungi that pulse faintly with bioluminescence. Dozens of **myconids** — mushroom-like humanoids — rise slowly from the ground, their movements serene and deliberate. The adventurers tense for battle, but instead of hostility, a soothing wave washes over their minds. Through a cloud of spores, an ancient consciousness reaches out — the **Myconid Sovereign**, whose words echo not in sound but in thought.\n\nIt speaks of their suffering. A monstrous creature has poisoned their home and enslaved their dead. The Sovereign offers a pact: destroy the abomination that haunts their caverns, and the group will receive the sacred **Will-o’-Wisp Flower**, a luminous bloom that grows only in the deepest sanctuaries of the fungal kingdom. To prove its sincerity, the Sovereign reveals the flower itself — glowing faintly with ethereal green light, cradled by roots like gentle hands.\n\nAccepting the deal, the group is joined by a small myconid scout who guides them deeper. The air grows toxic; spores swirl thick like fog. The faint sound of dripping water becomes a roar as they step into a vast underground lake. Floating across its black surface are **dozens of shambling corpses** — the undead remains of infected creatures animated by spore colonies. And from the darkness beyond, two enormous eyes open. The **Deep Dragon**, ancient and cunning, rises from the depths, its scales glistening like wet obsidian.\n\nThe ensuing battle is chaos incarnate. More than thirty spore zombies close in, their fungal limbs reaching for the living. Magic flares through the cavern — Eru’s spells sear through waves of undead, Astaroth’s infernal fire illuminates the dripping ceiling, and Soren’s commands rally the group in perfect sync. Astéria and Advenssax strike at the dragon’s exposed flanks, while clouds of poison and necrotic breath threaten to consume them all.\n\nThe struggle rages until the lake itself churns. As the dragon weakens, it dives beneath the water, vanishing in a spiral of black mist and rot. Its voice echoes faintly as it retreats — a promise of vengeance whispered through the depths. The spore zombies collapse lifelessly, and the cavern grows still.\n\nWhen the group returns, the Myconid Sovereign greets them with solemn reverence. The creature’s spores swirl in patterns of gratitude, and the **Will-o’-Wisp Flower** is placed gently into Eru’s hands. For the first time in days, the heroes feel something close to peace — though they know the dragon’s escape has merely delayed another reckoning."
  },
  {
    "session": 29,
    "chapter": 5,
    "title": "The Revenge of the Depths",
    "date": "6th of Mirtul",
    "characters": [
      "Nymph",
      "Raulothim"
    ],
    "summary": "After claiming the Will-o’-Wisp Flower, the group sails down a subterranean river, only to be ambushed by the vengeful Deep Dragon and its army of Blights. A radiant gem dragon spirit intervenes, sacrificing itself to ensure their victory.",
    "full_text": "Exhausted but triumphant, the party takes one final look at the silent cavern where the Deep Dragon once lurked. Before departing, they scour the creature’s lair, uncovering remnants of treasure buried beneath scales and bone — old relics, gold dust, and broken gemstones. Their victory feels hollow, a calm that seems far too temporary.\n\nUpon returning to the **Myconid Sovereign**, they are met not with grief but quiet joy. Through drifting clouds of luminous spores, the Sovereign explains that the dragon’s retreat is a greater blessing than its death — for by driving the creature away, they have spared the colony from the wrath of **Malabog**, Feywild’s monstrous king. A pact fulfilled without drawing divine attention. With solemn gratitude, the Sovereign grants them the promised **Will-o’-Wisp Flower**, glowing with the light of captured souls, and gifts them small living boats shaped from fungi and roots, each pulsing faintly like a heartbeat.\n\nThe group boards the organic vessels, letting the slow current guide them deeper through the phosphorescent river. The water glimmers with strange reflections — and then, faintly, they hear it: **a song**. A woman’s voice, haunting and clear, echoing through the tunnels. As the melody fills the air, a trance overtakes them. One by one, the adventurers feel their bodies grow weightless, their vision fading until they see themselves — not as flesh, but as shimmering **ethereal forms**. Their spirits drift freely above their bodies as the song grows louder.\n\nFrom the darkness ahead, the **Deep Dragon** returns. Its eyes blaze with fury, its scaled form tearing through the water alongside an army of **Blights** and **Vine Blights**, plants twisted by its corruption. Death feels inevitable; their disembodied forms seem powerless to fight. But before despair can take root, light floods the cavern. A second roar splits the darkness — pure, resonant, and filled with ancient strength.\n\nA **Gem Dragon**, formed entirely of radiant crystal and refracted light, rises from the lake. Its presence shatters the enchantment, forcing the heroes’ souls back into their bodies while taking momentary control of their movements to shield them. The **Nymph**, revealed as the guardian of this sacred place, sings in harmony with the gem dragon, and the battle ignites in a spectacle of color and sound.\n\nSoren’s spells crackle with mirrored precision, guiding attacks like music in motion. Advenssax becomes a whirlwind of violence, his strikes splintering Blights by the dozen. Astaroth channels infernal power through his pact, landing the final, devastating blow that pierces the Deep Dragon’s chest. The creature collapses into the water, its blood dissolving into clouds of black mist.\n\nBut victory carries a cost. The **Gem Dragon**, protector and savior, fades as its crystalline body fractures, light pouring from within until only silence remains. When the radiance dims, the heroes find a single **amethyst gemstone** resting on the ground — faintly pulsing, as though still alive. Whether it is a remnant of Raulothim, the fallen gem dragon, or something far older, none can say."
  },
  {
    "session": 30,
    "chapter": 5,
    "title": "Treants",
    "date": "6th of Mirtul",
    "characters": [
      "Nymph",
      "Raulothim",
      "Elder Treant"
    ],
    "summary": "Following the death of the gem dragon, the party follows a mysterious pulse from its amethyst heart that leads them to a grove where corrupted treants are waging war against their own. After a fierce battle, the Elder Treant aids the heroes and sacrifices one of his hearts to teleport them to Baldur’s Gate.",
    "full_text": "The echoes of battle still linger in the misty air as the group turns their gaze to the faintly glowing amethyst gem left behind by the fallen gem dragon, Raulothim. It thrums with life, each pulse sending a wave of violet light rippling through the clearing, pointing toward a distant horizon. The rhythm feels deliberate—like a heartbeat guiding them deeper into Feywild’s living soul.\n\nSoren kneels before the gem, speaking solemn words to the forest around them—a poetic plea filled with reverence for Feywild’s wild beauty and its mercurial spirits. His voice stirs the wind, and the **Nymph** answers, her tone both mournful and radiant. The forest responds in kind; the flowers bloom, trees groan as if awakening, and a path unfurls ahead like veins of light carved through the foliage.\n\nFollowing the pulse, the group advances under the Nymph’s guidance. She warns them that the **Treants**, the guardians of this land, are in peril—ensnared in a battle that could doom all of Feywild’s balance. As they move, she speaks of Raulothim’s true origin, revealing that the gem dragon was born from Feywild’s heart itself, and though his body has perished, his spirit will one day return. Then, without warning, every member of the group experiences a shared vision: **Tiamat**, the Five-Headed Queen, rising from a volcano’s mouth. None recall ever witnessing such a thing before, yet all feel its weight in their minds. Recognizing its importance, Soren hastily records the vision in his journal.\n\nThe trail opens into a vast glade—a graveyard of trees turned battlefield. Massive **Treants**, ancient and noble, fight against corrupted reflections of themselves—twisted mockeries animated by rot and shadow. Branches splinter, roots tear the ground, and the air hums with primal magic. The adventurers rush to aid the defenders, their magic and steel blazing amid the chaos. After a grueling struggle, the last corrupted giant falls, and the forest falls eerily silent.\n\nFrom the smoke and settling dust emerges the **Elder Treant**, his bark gleaming faintly with silver veins. He bows his immense form toward the heroes, his voice deep as the earth. Through his slow, resonant speech, he reveals secrets of the tome Soren carries and of the one who once wielded it—his old master, whose name has been lost to time. Upon hearing of the group’s quest for an antidote to save the poisoned, the Elder Treant offers aid beyond measure.\n\n“Every cure demands a price,” he intones. With deliberate solemnity, he reaches into his own chest, splintering wood and light, and tears free a **living heart of oak**, glowing with golden sap. The forest weeps and sings in unison as other Treants join him in a ritual that shakes the heavens. Light spirals upward, bending the air itself, and a great fissure opens in the sky.\n\nThe adventurers feel their feet leave the ground as the forest dissolves into starlight. Their surroundings blur, and the scent of moss and rain fades, replaced by the heavy air of smoke, iron, and civilization. The ritual completes—\n\nThe group stands once again upon solid ground, gazing at the distant skyline of **Baldur’s Gate**, summoned there by the sacrifice of a god among trees."
  }
]
