[
  {
    "session": 39,
    "chapter": 7,
    "title": "Journey to Waterdeep",
    "date": "1st–10th of Kythorn",
    "characters": [
      "Governor Nighthill",
      "Sir Polaris",
      "Cylyria Dragonbreast",
      "Keene Nine-Fingers",
      "Soren",
      "Eru Summering",
      "Astaroth",
      "Astéria",
      "Advenssax"
    ],
    "summary": "With Keene’s help, the group begins their calm voyage to Waterdeep. Through Sendings, they reach out to their allies—Nighthill, Sir Polaris, and Cylyria—seeking support and evidence against the Cult of the Dragon. While Nighthill agrees to help, Polaris and Cylyria prove hesitant. Near Daggerford, tragedy strikes through a vision: Soren’s beloved Maldwyn Daggerford has been murdered by the Cult.",
    "full_text": "With the chaos of Baldur’s Gate behind them, the party begins their journey north toward **Waterdeep**, once again traveling by ship. Thanks to **Keene Nine-Fingers**, who personally handled the bureaucratic mess of acquiring safe passage, their voyage proves uneventful—for the most part. The sea breeze carries calm rather than danger, giving the adventurers time to reflect, train, and prepare for whatever lies ahead.\n\nEarly into the voyage, the group agrees to contact their allies via **Sending**, hoping to gather tangible proof and political leverage for when they reach the **Lord’s Alliance**. They craft a single, unified message to send to each of their contacts:\n\n> *“We’re heading to Waterdeep to stop the Cult. We want to warn the Lord’s Alliance but need evidence of their activities. Can you help us?”*\n\nThe responses come in one by one:\n\n> **Governor Nighthill:** “It would be my pleasure to assist. I will send a sealed letter to the Waterdeep Post, detailing the attack. The password to retrieve it will be *Green Fields*.”\n\n> **Sir Polaris:** “I’ll forward your request to Lord Kelddath. Send another Sending tomorrow, at the same hour, for his response.”\n\n> **Cylyria Dragonbreast:** “I do not believe involving the Lord’s Alliance now is wise. They will demand mountains of proof, which we do not yet have. I advise a different course.”\n\nThe group debates Cylyria’s reluctance but decides to follow through with Polaris’ contact. The next day, they send another Sending:\n\n> *“We’ll arrive in Waterdeep in about ten days. We need tangible evidence before then. What did Lord Kelddath say?”*\n\n> **Sir Polaris:** “Lord Kelddath refuses to aid a fugitive and a convicted criminal who escaped Baldur’s Gate’s justice.”\n\nThe air grows tense as the group realizes their reputation is beginning to haunt them. Nonetheless, they reach out to Cylyria again:\n\n> *“We infiltrated the cult’s base in Baldur’s Gate and found a detailed report on the Draconian Operation. Isn’t that enough?”*\n\n> **Cylyria Dragonbreast:** “I still disagree. This is not a matter to be discussed through Sendings. It requires calm conversation.”\n\nA day later, as dawn breaks over the misty waves, Cylyria initiates a **Scrying** spell, projecting her ethereal presence aboard their vessel. The group hastily gathers their evidence—notes, runes, and the recovered **Draconian Report**—and presents them. The connection fades shortly after, but another Sending arrives soon after:\n\n> **Cylyria Dragonbreast:** “I’d like to study the book more carefully. These are vital insights into the Cult’s plans. The Alliance is made up of bureaucrats—they will deliberate endlessly before acting. We, however, can move swiftly and decisively.”\n\n> *“What do you suggest, then? Isn’t it better to start the bureaucratic process early, while we can?”*\n\n> **Cylyria:** “No. Work with me instead. Contact me again the day you reach Waterdeep—I’ll send instructions for how to deliver the book safely.”\n\nThe group agrees reluctantly, choosing pragmatism over protocol. The following days pass quietly as the ship drifts up the **Chiontar River** and then out into the **Sea of Swords**, cutting a path along the Sword Coast.\n\nBut on the eighth day, as the ship nears **Daggerford**, the group is struck by another vision—a cruel one. They see **Maldwyn Daggerford**, the Duke of Daggerford and the man Soren once loved, being brutally executed by the **Cult of the Dragon**. His lifeless body falls from the castle walls, marked with the cult’s draconic insignia, and the final words carved into the stone: *“For Soren.”*\n\nThe message is unmistakable. The cult’s vengeance is personal.\n\nSilence falls over the ship. No songs, no laughter—only the steady rhythm of the waves against the hull. The crew respects the quiet mourning of their passengers.\n\nBy the tenth day, **Waterdeep’s** skyline pierces the mist ahead—tall spires, banners of blue and gold, and the faint hum of a city that never truly sleeps. The group steps onto the docks with heavy hearts, their grief tempered by resolve. A new chapter begins, and the greatest city on the Sword Coast awaits them."
  },
  {
    "session": 40,
    "chapter": 7,
    "title": "Selûne’s Smile Inn",
    "date": "11th of Kythorn",
    "characters": [
      "Kyriani Agrivar",
      "Onyx the Invincible",
      "Volothamp Geddarm",
      "The Guide",
      "Astaroth",
      "Eru Summering",
      "Soren",
      "Astéria",
      "Advenssax",
      "Paimon"
    ],
    "summary": "Upon arriving in Waterdeep, the group contacts Cylyria and is directed to Selûne’s Smile Inn, where they meet Kyriani Agrivar and hear tales from the legendary adventurer Onyx the Invincible. A new lead emerges about a Shar cultist, Naren Dafyre, hiding in Skullport. With help from the famous bard Volo and a mysterious guide, the party descends into Skullport’s shadowy depths to meet Wilgold Gunderbradt, uncovering hints of a hidden power beyond the Mandible Guild.",
    "full_text": "After days at sea, the adventurers finally reach the sprawling docks of **Waterdeep**—the City of Splendors. But excitement quickly turns into concern: the harbor guards seem to be inspecting every arriving vessel. The group exchanges uneasy looks. Their ship holds several incriminating items tied to the **Cult of the Dragon**, and discovery could mean imprisonment—or worse.\n\nTo avoid unnecessary risk, **Soren** sends a **Sending** to **Cylyria Dragonbreast**:\n\n> “We’ve arrived in Waterdeep! We’re facing an inspection—too many cult artifacts with us. Can you help?”\n\nThe reply comes swiftly, and surprisingly calm:\n\n> “Go to **Selûne’s Smile Inn**. Speak with the innkeeper. As for the inspection… I don’t understand. There are no inspections.”\n\nRelieved but confused, the group makes their way through Waterdeep’s winding streets until a warm, celestial glow welcomes them into **Selûne’s Smile Inn**—a charming tavern filled with lunar motifs, soft silver light, and the faint sound of prayer hymns. Behind the counter stands **Kyriani Agrivar**, the half-elf proprietor, radiant in both beauty and kindness. She greets them as if expecting their arrival.\n\nOver a hearty meal and much-needed drink, the group listens as Kyriani shares stories of Selûne’s faithful and of adventurers who once served the goddess under the moonlight. The comfort doesn’t last long, however—soon, the tavern door creaks open, and an imposing figure steps through.\n\nA **dwarf clad in shining plate armor**, with the confidence of a seasoned hero, strides in carrying two heavy sacks. His presence alone commands silence. He introduces himself with a booming voice:\n\n> “Name’s **Onyx the Invincible**, champion of Moradin and walker of worlds! You may have heard of my deeds across the planes!”\n\nThe boast is soon softened by the arrival of his wife, a strong and witty adventurer who seems used to his theatrics. Together, they recount their journeys through strange realms and speak of their companion, a centaur named **Timoth**, who still roams the wild frontiers.\n\nBut among their stories, a crucial revelation surfaces: a **follower of Shar**, named **Naren Dafyre**, has been sighted in **Skullport**, working with a criminal syndicate known as the **Mandible Guild**. Onyx implores the group to aid in bringing Naren to justice, warning that his influence threatens to spread beyond the Underdark.\n\nMeanwhile, at another table, **Paimon** leans toward **Astaroth**, whispering of darker matters—new psychic allies are intercepting messages, assassinations are being carried out in the cult’s name, and the lines between loyalty and manipulation grow thin.\n\nAs the night deepens, another guest joins the conversation—a flamboyant man in bright, mismatched silks and a peacock feathered hat. His voice carries effortlessly across the room.\n\n> “Ah, the brave adventurers everyone’s been whispering about! I am **Volothamp Geddarm**, chronicler of wonders and survivor of a thousand taverns. Perhaps we can help each other?”\n\nVolo, ever the opportunist, offers valuable information about **Skullport**—in exchange for a favor. He hands the group a sealed letter and requests its delivery to a man named **Wilgold Gunderbradt** deep within the subterranean city. In return, he promises safe passage and the assistance of a mysterious figure known only as **The Guide**.\n\nThe group accepts, and before long, The Guide—a cloaked individual with eyes like molten gold—leads them through the dark alleys of Waterdeep to a hidden trapdoor beneath an abandoned home. Beneath lies a secret passageway that winds downward, twisting into the depths beneath the city.\n\nHours later, they emerge into the eerie, luminescent underbelly of **Skullport**, a maze of shadows and crime lit by ghostly fungus and blue fire lamps. Following The Guide’s directions, they find their way to a smoke-filled tavern where whispers replace laughter.\n\nThere, they meet **Wilgold Gunderbradt**—a man with a scarred face, eyes sharp as daggers, and a calm that hides something sinister. Without a word, he takes Volo’s letter, reads it briefly, and tosses it into the fire. The parchment curls into ash.\n\n> “The Mandible Guild?” he says, his lips curling into a faint smile. “They’re not the biggest power in Skullport. Not by far.”\n\nThe group exchanges wary glances as Wilgold continues, voice low but deliberate:\n\n> “There’s something else—something old—pulling the strings down here. You came looking for the Cult’s shadow? You’ve just stepped into it.”\n\nThe flames flicker, and for a brief moment, the shadows on the wall seem to move on their own.\n\nThe group realizes this journey into Skullport will reveal far more than they expected—and that Cylyria’s “no inspections” was never reassurance. It was a warning."
  },
  {
    "session": 41,
    "chapter": 7,
    "title": "Skullport",
    "date": "11th of Kythorn",
    "characters": [
      "The Guide",
      "Wilgold Gunderbradt",
      "Naren Dafyre",
      "Mandible Guild Members",
      "Xanathar"
    ],
    "summary": "In Skullport, the group provokes the Mandible Guild into a trap at the arena, sparking a brutal fight that leaves several guild members dead. Amid the chaos, Wilgold reveals shocking truths about Waterdeep’s underworld, the true nature of Xanathar, and the long-lost Stargazers led by Adele Astrolara. The party learns that Kyriani Agrivar may hold the key to uncovering the fate of this mysterious order.",
    "full_text": "The shadows of **Skullport** feel thicker the longer the group stays. Down here, even whispers have weight. The **Guide** leads them through tunnels slick with condensation, until the air fills with the faint hum of distant crowds—the sound of an arena.\n\n**Wilgold Gunderbradt** proposes a dangerous idea: draw out the **Mandible Guild** by stirring the hornet’s nest. After a brief debate, the adventurers agree. A public confrontation will expose their enemies—or kill them trying.\n\nThe plan unfolds under the arena’s flickering torchlight. Soren and Astéria play the part of reckless gamblers, while Eru and Astaroth assume positions in the stands, watching, waiting. **Advenssax** and **Paimon** circle the exits like silent predators.\n\nWhen the guild’s enforcers finally appear, the tension snaps. The fight is immediate and merciless. Steel flashes, spells explode, and screams echo through the dark amphitheater. The **Mandible** assassins move like a hive—coordinated, cold, and confident. But the adventurers are faster. One by one, the guild’s blades fall.\n\nThen, a sudden explosion erupts outside the arena, scattering debris and breaking the crowd’s nerve. Chaos surges through the stands as another group—unaffiliated mercenaries—strike from the shadows. In the confusion, **three Mandible operatives die**, while **two escape** into the labyrinthine streets. Moments later, a contingent of thugs bearing the sigil of a single, glaring eye arrive: the **Xanathar Guild**. Their leader, calm and oddly polite, assures the group that they will ‘handle what remains of the Mandible problem.’ The tone suggests both gratitude and warning.\n\nAfter the dust settles, **Wilgold** invites the group back to the safety of his dimly lit tavern. There, with blood still drying on their armor, he begins to talk.\n\n> “You should know… ‘Xanathar’ isn’t a person. It’s a title. When one dies—or disappears—another takes its place. Skullport and Waterdeep have always lived under that shadow.”\n\nHe leans back, pouring a glass of black wine, and continues:\n\n> “Waterdeep’s richer than you think. It doesn’t just trade with cities—it trades with worlds. Some say their markets reach across planes. Gold flows here like lifeblood through a god’s veins.”\n\nAs conversation turns toward the **Ropers**—strange creatures the group mentioned from past travels—Wilgold’s composure falters for the first time.\n\n> “Ropers don’t speak,” he says sharply. “They never have. Whoever told you that is lying… or cursed.”\n\nThe group exchanges uneasy looks.\n\nSeeking to pivot the topic, **Soren** presses him for information about the **Stargazers**, hoping to connect their discoveries. Wilgold scoffs softly.\n\n> “Haven’t heard that name in a long time,” he admits. “They were an academy… all women, gifted in the arcane. Founded by **Adele Astrolara**—brilliant, but ruthless. Families gave up their daughters to her. Legally. She made them sign documents declaring the girls as orphans of knowledge, bound only to study and secrecy.”\n\nHe takes a slow drink before continuing.\n\n> “Adele vanished decades ago. No one knows what happened. Some say she reached beyond the stars; others, that her own students turned against her. The academy itself faded like smoke.”\n\nSoren asks where they might find more information. Wilgold smiles knowingly.\n\n> “Your friend **Kyriani Agrivar** was one of them—a **Star Sister**. She’d know more than anyone still breathing. And there’s an old rumor… that the innkeeper herself isn’t what she seems. Some say **Selûne** walked among mortals once, running a tavern under her own name. Fanciful, but… it fits the poetry of this city.”\n\nAs the lanternlight flickers, the group’s attention drifts to the symbol carved into the tavern wall—a jagged, spiral fang. Wilgold notices their gaze.\n\n> “That’s where the guild gets its name,” he says quietly. “The Mandible. It isn’t just a symbol. It’s a relic—a dragon’s tooth, forged into a blade that hungers for magic. Whoever wields it leads the guild… or so they say. No one’s seen the Mandible’s true master in decades.”\n\nThe tavern grows silent as the truth sinks in. Somewhere in Skullport, a relic of dragonbone—and its unseen master—still waits in the dark.\n\nAnd now, the adventurers have drawn its attention."
  },
  {
    "session": 42,
    "chapter": 7,
    "title": "Waterdeep",
    "date": "12th of Kythorn",
    "characters": [
      "Kyriani Agrivar",
      "Onyx the Invincible",
      "Timoth Eyesbright",
      "Volothamp Geddarm",
      "The Guide",
      "Halia Thornton",
      "Venomfang"
    ],
    "summary": "Back in Waterdeep, the group meets Volo and the centaur Timoth, who agrees to join them on their next journey. After a tense discussion about the Cult of the Dragon, the masks, and Nym’s whereabouts, Volo helps them reach Phandalin through a portal. There, Halia Thornton and Venomfang reveal their ongoing research on the White Dragon Mask, whose power and will seem to defy all attempts to control it.",
    "full_text": "The morning sun creeps through the gray skies of **Waterdeep**, illuminating the cobblestones slick from last night’s rain. The adventurers reconvene at the **Selûne’s Smile Inn**, preparing their questions for **Volothamp Geddarm**, whose fame fills the city as much as his ego. Before long, the taverna’s heavy door creaks open, and a centaur steps in—towering, proud, and dressed in fine steel barding polished to a mirror shine.\n\n“**Timoth Eyesbright**,” he introduces himself, voice calm yet commanding. “I heard whispers of your battle against the Cult of the Dragon. Impressive work. Few live long enough to speak of such encounters.” He explains his return to Waterdeep under a rare **temporary authorization from the Parliament**, only granted in times of dire need. The presence of both a centaur and Volo in the same room draws every curious gaze in the inn.\n\nAs they sit together, **Volo** steeples his fingers and leans forward, his eyes glittering with mischief. “So, about **Naren Dafyre**... a pity what became of him. A follower of Shar deserves no mercy, though I must admit—his death was... useful.” He avoids elaborating, deflecting with a smirk and a gulp of his wine. His cryptic tone suggests personal involvement, but no one presses him further.\n\nWhen **Soren** inquires about **Khelben Arunsun**, the legendary Blackstaff of Waterdeep, Volo’s demeanor shifts to reverence. “Khelben believed that bardic lore was the spine of civilization—without our songs, history dies. He saw preservation as the highest calling.” Soren nods thoughtfully, unaware of how deep those words would echo later.\n\nThen **Astéria** dares the question that darkens the air: “What are **Severin’s** plans with the Cult of the Dragon?” Volo’s smile fades. Before he can reply, **Timoth** closes his eyes, recounting a vision—**a volcano and Tiamat’s five heads rising from its heart**—the same imagery the group had once seen carved on ancient stone. The coincidence sends a chill through the room. Volo confesses ignorance of the Masks’ full nature. “I’ve heard of their influence… but not their true power. They’re beyond mortal craft.”\n\n**Eru** asks about **Nym**, their missing ally. Volo’s brow furrows. “Last rumors placed him near the **High Forest**, north of the Dessarin Valley. But if he still lives, he walks a dangerous path.” When **Astaroth** brings up **Naerytar**, Volo’s eyes gleam. “A castle,” he confirms. “Deep in the **Mere of Dead Men**. Few return from there. It’s a place swallowed by both time and swamp.”\n\nAt that moment, **Timoth** stands, hooves clattering against the floor. “Enough delays. Keene’s message was a sign. We can’t afford another voyage by sea. There’s a faster way—through a **portal**.” He gestures to the rear of the tavern. The group exchanges wary glances but agrees.\n\nBefore they depart, Soren hands a sealed tome to Volo. “For Cylyria. Make sure it reaches her intact.” Volo bows theatrically, slipping it into his satchel. “You have my word, my friends. May the stars favor your next chapter.”\n\nThe portal flares to life, shimmering with silver light. In an instant, they’re no longer in Waterdeep but standing in the damp chill of a **cavern near Phandalin**, the smell of moss and earth thick in the air. From the shadows, a familiar voice greets them.\n\n“Welcome,” says **Halia Thornton**, stepping forward, her demeanor calm but her eyes sharp. “You’ve arrived sooner than expected.” Behind her, a massive shape shifts—**Venomfang**, his green scales glimmering faintly in the cavern’s torchlight. The dragon lowers his head to study them, his eyes filled with restrained fury.\n\n> “We’re studying the mask,” Halia explains. “Progress is... limited. We don’t know how to use it, or what its true nature is. Every attempt ends the same way—failure.”\n\nVenomfang growls, his voice reverberating through the stone chamber. “The mask hungers. It seeks its master. Whoever tries to claim it risks becoming part of it.” His tail lashes, cracking stone. “There’s will inside it. A memory older than gods.”\n\nHalia places a hand on the table beside her, where the **White Dragon Mask** rests, faintly glowing. “Tell **Eva** that research continues,” she says. “But we’ve reached an impasse. There are… alternatives, though none without great peril. When the time comes, I’ll call upon you again.”\n\nThe adventurers gather around the artifact. The air hums with energy. Through the intricate filigree of white scales, they glimpse shifting runes, symbols that shimmer between **all eight schools of magic**—evocation, illusion, necromancy, and more—all intertwined in impossible harmony.\n\nFor the first time, they realize the truth: this mask isn’t just a relic. It’s alive."
  }
]
