[
  {
    "session": 31,
    "chapter": 6,
    "title": "Baldur’s Gate – Zhentarim",
    "date": "6th of Mirtul",
    "characters": [
      "Tolly",
      "Pipin",
      "Thogrim",
      "Grukk",
      "Eva",
      "Eva’s Girlfriend",
      "Clark",
      "Zhentarim"
    ],
    "summary": "The group’s sudden arrival in Baldur’s Gate brings them into contact with Eva and the Zhentarim, who coerce them into collaboration. Astéria is revealed to be a Guild heiress, and Eva offers key information about the Cult of the Dragon in exchange for the group’s cooperation with Halia Thornton in Phandalin.",
    "full_text": "The sudden teleportation into Baldur’s Gate leaves the group disoriented, standing in the dark streets of a city that feels alive and dangerous. Even native Baldurians appear confused by the arcane phenomenon that brought them here. The night is thick and the district unsettling, forcing the adventurers to seek shelter. Astaroth insists they accept the first decent tavern they find, but Soren refuses to rest in a place he deems 'unfit for civilized beings.' After wandering through the dim-lit alleys, they find a better establishment and settle there.\n\nInside, the tavern hums with life—merchants, rogues, and wanderers sharing cheap ale and quieter ambitions. Soren joins two halfling bards, **Tolly** and **Pipin**, laughing and exchanging songs, while Advenssax takes position at the entrance. Meanwhile, **Astéria**, **Eru**, and **Astaroth** approach the barkeep, **Thogrim**, seeking news. His stories paint a grim picture: Baldur’s Gate stands in uneasy times, rife with crime and political turmoil. As the night deepens, one by one, the patrons drift away until silence falls like a heavy curtain.\n\nTwo rooms are rented—one large, one small—dividing locals from outsiders. Astéria and Astaroth share one, while Soren, Advenssax, and Eru take the other. When the question of who should keep watch arises, Astaroth offers a solution: his imp, **Paimon**, will guard through the night. Relieved, the group retires to rest.\n\nBut peace never lasts long.\n\nAstéria awakens to the icy kiss of steel pressed against her throat—a dagger’s edge, cold and deliberate. A calm voice whispers in her ear, demanding cooperation. Her eyes dart to Astaroth pacing nervously, and beyond him, a woman cloaked in shadow: **Eva**. Moments later, **Clark**, the man behind the blade, pulls her upright and escorts her downstairs, where a quiet assembly awaits. Astaroth rouses the others, urging compliance, and soon everyone gathers in the tavern’s dim common room.\n\n**Eva**, poised and commanding, introduces herself and explains the situation. She reveals that **Astéria** is the hidden heiress of the Thieves’ Guild, once led by **Keene Nine-Fingers**, and her existence grants the **Zhentarim** leverage over the city’s criminal underworld. They intend to use her influence to gain access to restricted districts—intelligence vital to their war against the **Cult of the Dragon** and its mysterious **Operation Draconian**.\n\nEva offers information in exchange for cooperation. She explains the power of the **Dragon Masks**, artifacts that enslave dragons to their wearers, and warns that the **Blue Dragon** once serving Frulam did so under the control of the **Blue Dragon Mask**. The wearer, she adds, is cursed by the same domination they wield. As part of their arrangement, Eva demands that the group seek out **Halia Thornton** in **Phandalin**, promising in return the location of **Naerytar**, a castle she claims is tied to the Cult’s leadership.\n\nBefore leaving, Eva divulges one final secret: the hill connected to the **Chiontar River**, long abandoned, once served as **Valarken’s** base—and now belongs to the Cult. Though she’s led assaults there, all have failed. Her tone makes clear she expects the adventurers to succeed where she did not.\n\nAs her entourage departs, silence returns. The group’s eyes fix on Astaroth, demanding answers. After a tense pause, he confesses his involvement with the Zhentarim—explaining that his membership was born of necessity, not loyalty. He details his binding contract and motives, seeking understanding. Astéria, torn between fury and pity, sets conditions: no more secrets, no more betrayals. Astaroth agrees, and she banishes him from their shared room, forcing him to sleep with Soren and Advenssax.\n\nWhen dawn breaks, the group resumes its mission. They travel through the labyrinthine streets toward the **Black Dragon Gate**, where foreign travelers are required to pay a tax before entry into the Upper City. Once cleared, they are escorted by **Watchers** through the gates, past marble walls and affluent courtyards, to the apothecary where the **antidote** can finally be brewed. The process succeeds without incident. With the cure complete, the adventurers gather once more, the path ahead clear: they must return to **Elturel**, to finish what was started."
  },
  {
    "session": 32,
    "chapter": 6,
    "title": "Baldur’s Gate – The Guild",
    "date": "7th of Mirtul",
    "characters": [
      "Keene Nine-Fingers",
      "Isolda 'Thunder Spear'"
    ],
    "summary": "After completing the antidote, the group faces chaos within Baldur’s Gate as Keene Nine-Fingers demands the return of her heir, Astéria. A tense confrontation follows within the Guild’s hideout, forcing the adventurers to navigate between Keene’s fury and the remnants of Zhentarim influence before setting off toward Elturel.",
    "full_text": "With the antidote completed and their affairs in Baldur’s Gate settled, the group takes a moment to decide their next move. Though weary from the city’s dangers, they agree to accept **Eva’s** earlier mission—to meet **Halia Thornton** in Phandalin. To confirm their departure, **Paimon** is summoned and sent to inform Eva. Yet the imp returns not with her voice, but with chaos: Eva has left the city, and **Keene Nine-Fingers**, matriarch of the Guild, has gone mad with rage. She demands the immediate return of her heir, **Astéria**, threatening to slaughter every Zhentarim in Baldur’s Gate within the hour if her daughter is not brought to her. Even when Eva attempts to intimidate Astéria from afar, Keene’s resolve remains unshaken—she will see her heir or the streets will run red.\n\nFaced with an impossible choice, the group chooses diplomacy over defiance. Guided by Astéria herself, they travel through twisting alleys and damp tunnels until reaching the hidden heart of the **Guild**. Inside, the air is thick with incense, oil, and tension. Strange artifacts line the walls—trophies of decades spent mastering the city’s shadows. At the chamber’s end sits **Keene Nine-Fingers**, formidable and scarred, her one good hand drumming the armrest of her chair. Beside her stands **Isolda 'Thunder Spear'**, a powerful enforcer of the Lady’s Court—and, to Astaroth’s horror, a familiar face.\n\nRage flashes across Astaroth’s eyes the instant he recognizes her. Isolda’s expression remains unreadable, but her voice is sharp when she orders, 'Drop your weapons. Mages, wear the cuffs.' She extends a set of anti-magic bracelets, even toward Astéria—a gesture that stings, but one Keene’s eyes insist upon.\n\nThe interrogation begins. Keene demands to know what happened to her heir, what schemes Eva is plotting, and what involvement the Zhentarim have in this affair. The adventurers answer truthfully, recounting Eva’s manipulation and the cultist plots that stretch far beyond Baldur’s Gate. Their honesty softens Keene’s fury, if only slightly. She signals for her agents to begin an internal purge, promising to investigate the Zhentarim’s ties to the Cult of the Dragon. Her demeanor shifts from wrathful mother to calculating strategist as she vows to defend Baldur’s Gate like the legendary **Beloved Ranger** himself.\n\nThen, with a grin both wicked and knowing, Keene turns her gaze to Soren. She remarks that the bard’s 'late-night encounters' with the wife of a city counselor had not gone unnoticed, and that the Guild had quietly handled the fallout. Embarrassed, Soren mutters something about diplomacy through song, earning smirks from nearly everyone in the room.\n\nBefore the group departs, **Eru** steps forward with a request: that the freshly-brewed antidote be delivered to **Captain Halvard**, to spare his life. Keene nods, promising it will reach him safely. With that, the meeting concludes.\n\nOutside, the cool air of Baldur’s Gate feels lighter but not peaceful. The group gathers for one final conversation before splitting paths. Their alliance holds, though tension lingers in the words left unsaid. After a brief argument and a shared promise, they agree to reunite in **Elturel**. One by one, they turn toward their separate roads—each burdened by secrets, debts, and destinies yet to be fulfilled."
  },
  {
    "session": 33,
    "chapter": 6,
    "title": "Personal Journeys",
    "date": "7th–24th of Mirtul",
    "characters": [
      "Astaroth",
      "Astéria",
      "Soren",
      "Eru",
      "Advenssax"
    ],
    "summary": "After parting ways in Baldur’s Gate, each member of the group embarks on a personal journey. Their paths diverge in pursuit of answers, redemption, and strength before they reunite in Elturel.",
    "full_text": "Following the intense confrontation within the Guild, the party disperses—each member drawn to a calling that cannot be ignored. **Astaroth**, burdened by his ties to the Zhentarim, seeks solitude and perhaps absolution in the city’s shadows. **Astéria**, now under the eyes of Keene Nine-Fingers, faces the legacy of her lineage and the weight of the Guild’s expectations. **Soren** disappears into the winding alleys of Baldur’s Gate, chasing old songs, new sins, and perhaps a sliver of truth. **Eru** turns inward, following traces of ancient arcana and the whisper of names long forgotten. **Advenssax**, silent but restless, follows his own road—one that may lead to his brother, **Exiressax**, or to something darker still.\n\nThese weeks are left veiled in secrecy. Each path is walked alone, filled with choices known only to the traveler. The details remain unspoken, even among friends, preserved in silence until the day their stories intertwine once more. All that is certain is this: by the 24th of Mirtul, each of them finds their way back toward **Elturel**, changed in ways only they can understand."
  },
  {
    "session": 34,
    "chapter": 6,
    "title": "Reunion",
    "date": "25th of Mirtul",
    "characters": [
      "Ontharr Frume",
      "Astaroth",
      "Astéria",
      "Soren",
      "Eru",
      "Advenssax"
    ],
    "summary": "After weeks apart, the group reunites in a quiet Baldur’s Gate tavern. They share their findings—secrets about dragons, cults, and long-lost relics—before meeting Ontharr Frume to plan their next move against the Cult of the Dragon.",
    "full_text": "After their time apart, the companions of Nym Storm reunite under the muted hum of rain. In a secluded tavern lit by candlelight, they gather around a table, protected by a magical bubble of silence. Old tensions dissolve into familiarity as stories begin to unfold. **Soren** speaks first, revealing that the **Black Eagles** hold a fortress east of **Iriabor**, along the same route the Cult of the Dragon has taken. **Eru** follows, sharing a cryptic discovery—an ancient record referencing the **Treaty of the Five Dragons** and the mysterious **Codex Draconis**. **Astaroth**, always the pragmatist, notes a lead near **Phandalin**, where a green dragon named **Venomfang** might be persuaded to ally with them. Then come **Astéria** and **Advenssax**, their revelation silencing the table: the gem dragon **Raulothim**, once thought slain, was behind their shared visions all along—and he possessed **Drak**, Eru’s missing familiar hand.\n\nThe air thickens with realization. Each fragment of information pieces together a much larger picture—one of dragons, destiny, and deception. After exchanging every last detail, the group heads to meet **Ontharr Frume**.\n\nFrume greets them gravely, his usual cheer dimmed by urgency. He reports that the **Cult’s caravan** has already passed **Scornubel**, making an ambush there impossible. Their wagons travel unnaturally fast, aided by repeated use of *Longstrider*—an alarming display of magical resources. Worse yet, rumors circulate among sailors from **Waterdeep** that **Naerytar** is not a fortress, but a long-abandoned **academy of magic** known as **Stargazers**. The name alone sends a chill through the room.\n\nFrume closes the meeting with one final revelation: the Cult’s leader is **Severin Silrajin**, the Red Wyrmspeaker—a name synonymous with ruthless ambition and power. The implications are clear. With dragons stirring and the masks resurfacing, the group must decide their next step carefully: to pursue the Cult’s caravan and risk the unknown, or to forge a new path entirely."
  },
  {
    "session": 35,
    "chapter": 6,
    "title": "Return to Baldur’s Gate",
    "date": "26th–29th of Mirtul",
    "characters": [
      "Raulothim",
      "Joybringer Caseldown",
      "Matthew Cauthon",
      "Jamna Gleamsilver",
      "Draconian Mastermind"
    ],
    "summary": "The group sails back to Baldur’s Gate while Paimon follows the Cult’s caravan by air. Chaos erupts when Raulothim awakens in madness, and later the party faces ambushes, Zhentarim allies, and a deadly draconian attack beneath the city’s cursed tree.",
    "full_text": "After weighing their options, the group settles on a plan: **Paimon** will shadow the Cult’s caravan from the skies, while the rest sail to **Baldur’s Gate**, aiming to reach **Waterdeep** ahead of the cultists. The first two days pass uneventfully, but on the third night, disaster strikes. **Raulothim**—the gem dragon whose essence had accompanied them—awakens in a state of violent confusion. His mind fractured, he lashes out at the crew, threatening to destroy the vessel and everyone aboard. Only after **Soren** sends a desperate *Sending* to **Joybringer Caseldown**, confirming the group’s intentions and honesty, does Raulothim calm, regaining his composure and lucidity. He speaks briefly, asking after **Nym**, curious about the party’s path forward, before vanishing into the skies.\n\nTheir voyage resumes, the waves eerily still beneath the shadow of the Chionthar. When the coast of **Baldur’s Gate** finally appears, the group spots a dark mountain nearby—the rumored entry to the Cult’s stronghold. Compelled by instinct, they vow to investigate it later. For now, the harbor demands attention.\n\nAs they near the docks, chaos strikes once more: a **dragon turtle** rises from the depths, its shell shimmering with molten cracks. The battle is fierce but brief—the party’s combined might drives the beast back into the depths, saving the harbor from ruin. The price, however, is time. The **Flaming Fists** have noticed the commotion, and **Soren**, being wanted, forces a hasty retreat. With the help of their Baldurian allies, the group escapes into the maze-like alleys of the Lower City.\n\nEventually, they reach the **Harborside Hospital**, when sudden *Sendings* reach several of them. **Astaroth** halts, listening to voices only he can hear, then insists they follow him instead—to the infamous **Insight Park**. There, in the presence of a massive, cursed tree whose branches twist unnaturally, the group encounters two familiar figures: **Jamna Gleamsilver** of the **Zhentarim**, and **Matthew Cauthon** of **The Guild**.\n\nThe uneasy alliance becomes clearer: **Eva** and **Keene**, the leaders of their respective factions, have struck a temporary truce, sending these two agents to assist the group in infiltrating the **Draconian Operation** site beneath the city. Their orders—observe, report, and survive. Jamna’s paranoia fills the air; she warns that the Cult may already be hunting them. Moments later, her fears prove right. A squad of **draconians** ambushes them under the canopy of the cursed tree. The battle is brutal, the enemy cunning, but the adventurers prevail—though drained, bloodied, and wary of what comes next.\n\nAs the echoes of combat fade and the shadows deepen, **Soren** speaks up. He knows a place, he says—somewhere safe enough to rest. For now, after so much chaos, that’s all anyone can ask for."
  },
  {
    "session": 36,
    "chapter": 6,
    "title": "In the Heart of Operation Draconian",
    "date": "30th of Mirtul",
    "characters": [
      "Francesca Ravengard",
      "Soren",
      "Astéria",
      "Astaroth",
      "Eru",
      "Advenssax",
      "Matthew Cauthon",
      "Jamna Gleamsilver"
    ],
    "summary": "Following Soren’s dubious lead, the group takes shelter with Francesca Ravengard, wife of Duke Ravengard. After a troubled rest, they infiltrate the cult’s base beneath Baldur’s Gate and uncover the heart of Operation Draconian — a site of dragon egg corruption and disturbing magical experimentation.",
    "full_text": "Soren’s proposed refuge raises immediate doubts—his contact turns out to be **Francesca Ravengard**, wife of Duke **Ulder Ravengard** himself. Despite unease, the party concedes and follows him to a tavern where Francesca awaits. She welcomes them with disarming warmth—too much warmth—and Soren soon finds himself at the center of her indecent attention, to the amusement and horror of his companions. The group is offered private quarters for the night, while **Matthew** and **Jamna** are pointedly denied entry. As Francesca departs, **Astéria** confides in the others about how Matthew had once sabotaged her in a past operation, insisting he cannot be trusted.\n\nThe group finally rests, but the peace is short-lived. **Soren** awakens ill—feverish, delirious, and visibly weakened. The cause quickly becomes apparent: the residual venomous breath of the **purple draconian** from their previous battle. If so, **Jamna** and **Matthew** may have been exposed as well. Seeking aid for Jamna, **Astaroth** sends a *Sending* to **Blake**, ensuring the Zhentarim agent will not be left unguarded. Yet despite the growing sickness and uncertainty, the mission cannot wait—the group must investigate the cult’s stronghold.\n\nTo speed their advance, **Eru** transforms into a massive crab, carrying the party on his shell as they make their way toward the ominous hill where the **Draconian Operation** is said to take place. The entrance, marked by the sigils of the **Cult of the Dragon**, reeks of decay and abandoned rituals. The halls beyond are in chaos—signs of battle, overturned furnishings, and scattered scrolls tell of a hasty evacuation. Every wall seems to whisper devotion to Tiamat.\n\nDeeper inside, they reach the true heart of the operation. The air is heavy with arcane energy; **dragon eggs**—some intact, others warped and corrupted—are arranged in a ritual circle etched with glowing runes. The group’s investigation reveals the nature of these inscriptions:\n\n- A set of runes designed to *re-corrupt* already tainted dragon eggs, forcibly mutating them into **draconians**.\n- Enhancements to their *physical strength*, rendering them far more powerful than ordinary dragonborn.\n- Another unidentified set of runes whose purpose remains a mystery.\n- A sequence devoted to *mental control*, ensuring absolute obedience of these creatures to their creators.\n- And lastly, enchantments of *rapid regeneration*, allowing draconians to recover from even lethal wounds.\n\nEach discovery confirms the cult’s horrifying success in fusing divine corruption, necromantic control, and draconic essence into living weapons. In a side chamber, among piles of burned reports, the group uncovers a half-intact document—its words barely legible, but unmistakable: proof that **Operation Draconian** is real.\n\nWith evidence finally in hand, the adventurers realize they stand at the edge of something far greater and darker than they ever imagined."
  },
  {
    "session": 37,
    "chapter": 6,
    "title": "The Death of Lennithon",
    "date": "30th of Mirtul",
    "characters": [
      "Lennithon",
      "Draconian Mastermind",
      "Joybringer",
      "Soren",
      "Eru Summering",
      "Advenssax"
    ],
    "summary": "The party explores an abandoned Cult of the Dragon cell in Baldur’s Gate, only to face Lennithon in a fierce underground battle. Through deception and determination, they slay the blue dragon and strike a major blow against the cult.",
    "full_text": "The adventurers make their way toward one of the **abandoned cells of the Cult of the Dragon** beneath Baldur’s Gate. **Soren**, with his characteristic flair for the dramatic, had transformed **Eru Summering** into a massive crab once again, serving as both transport and guardian. The descent into the underground complex reveals a twisting dungeon carved in black stone, its walls scorched and marked by arcane sigils of lightning. Despite its apparent abandonment, the faint hum of draconic energy suggests something alive still lingers within.\n\nTheir exploration is soon interrupted by a deafening roar—the air trembles as **Lennithon**, the ancient blue dragon responsible for countless atrocities in Greenest, tears through the ceiling in a storm of sand and lightning. The group braces for combat as the creature’s massive form dominates the corridor. To make matters worse, another force seems to advance from behind them—more cultists, perhaps an ambush. Surrounded, they prepare for what feels like their final stand.\n\nBut the supposed reinforcements prove to be an illusion, conjured to sow panic. Once **Eru** identifies the deception, the group regains control of the fight. **Astaroth** and **Eru** unleash waves of magic, while **Astéria** and **Soren** coordinate precision strikes, and **Advenssax**, driven by fury, delivers the killing blow—a final strike that pierces Lennithon’s throat and brings the dragon crashing to the stone floor in a thunderous echo.\n\nAs the dragon dies, the group learns troubling fragments through the chaotic telepathic link that briefly connects them to **Raulothim**, the gem dragon. They realize he is in turmoil, his mind fractured and raging somewhere near **Hill’s Edge**, where he has begun to lose control of his power. **Soren**, desperate to reach him, sends a *Sending* mid-battle, but Raulothim is too unstable to respond.\n\nThe fight’s aftermath is as grim as it is victorious. The dungeon quakes, collapsing under the dragon’s weight and the unleashed energies of the battle. Just as it seems they will be buried alive, reinforcements from the **Zhentarim** arrive—Eva’s network, responding to their earlier contact. Together, they help the battered adventurers escape the crumbling tunnels.\n\nOutside, amid the smoke and thunder of a dying storm, the truth becomes clear: the group has slain **one of the Cult’s leading dragons**, a devastating blow to the Draconian project. For the first time, there’s a glimmer of hope that the cult’s power can truly be broken—but the cost, and the storm to come, remain uncertain."
  },
  {
    "session": 38,
    "chapter": 6,
    "title": "Consequences",
    "date": "30th of Mirtul",
    "characters": [
      "Joybringer",
      "Alicia (Eva)",
      "Seraphina Leonesa",
      "Soren",
      "Astaroth",
      "Advenssax"
    ],
    "summary": "In the aftermath of Lennithon’s death, the group receives a new vision and encounters Seraphina Leonesa, Champion of Torm. Both she and Eva offer alliances—one through the Order of the Gauntlet, the other through the Zhentarim. Critical revelations emerge, including that the White Dragon Mask is in Zhentarim hands.",
    "full_text": "After the grueling battle that ended with **Lennithon’s fall**, the adventurers take refuge in one of the surviving chambers of the cult’s fortress. The air is thick with the scent of ozone and burnt scales, and for the first time in what feels like weeks, there is silence. They talk quietly among themselves—each trying to process the chaos that had just unfolded beneath Baldur’s Gate. Yet peace does not last long.\n\nWithout warning, a new **vision** overtakes them all—fragmented, fleeting, and chaotic. They see a **towering figure**, as tall as **Advenssax**, stepping out of a cave mouth onto the edge of a high cliff. Below, the world is swallowed by clouds, stretching endlessly in every direction. A **massive white dragon’s wing** sweeps through the fog, glinting in the light. The mysterious being holds a **horn forged from violet dragon scales**, laced with shimmering metallic bands and strips of interwoven leather that pulse with power. The image fades as quickly as it appeared, leaving behind the echo of a distant, resonant hum.\n\nTroubled by the vision, the group asks **Soren** to send a *Sending* to **Joybringer Caseldown**, seeking clarity. The reply is grim: **Raulothim** has calmed, but not without consequence. His mind remains fractured, riddled with psionic spasms and uncontrollable outbursts that have left many wounded—or worse—throughout Hill’s Edge. The Song Dragon’s sanity hangs by a thread.\n\nAs the group debates their next move, **Astaroth** abruptly leaves the room. Moments later, his shout echoes down the hallway where Lennithon had perished. The others rush to find him face-to-face with an awe-inspiring woman—a radiant presence whose mere gaze commands reverence and fear. She introduces herself as **Seraphina Leonesa**, Champion of **Torm**, leader of the **Lady’s Court**, and the living embodiment of the **Order of the Gauntlet’s** authority. Sent by Joybringer herself, Seraphina explains that she is there to fulfill a divine pact of mutual aid: the Gauntlet will provide support and sanctuary to the adventurers, though they are not bound to formally join the order.\n\nSeraphina mentions the existence of **critical Cult of the Dragon reports**—documents that could prove invaluable to the **Lord’s Alliance**. She assures the group that **Ontharr Frume** has already secured them a bastion near **Elturel**, a riverside stronghold along the Chiontar, now under renovation. When the work is done, it will serve as their new base of operations, a symbol of their growing reputation.\n\nSoon after, **Eva**—or rather **Alicia**, as she now reveals herself—arrives, radiating her usual sharp confidence. She makes a counteroffer on behalf of the **Zhentarim**, proposing a network of shared intelligence and mutual benefit through the **Black Network**, rather than a purely militant alliance. The group accepts both offers, forging tenuous partnerships with two of Faerûn’s most powerful factions.\n\nThen comes a revelation that stuns even the veterans of the group: through **Astaroth**, Alicia reveals that the **Zhentarim are in possession of the White Dragon Mask**, stolen on the **11th of Alturiak**. The mask is being kept safe—but its power must remain dormant, guarded by **Venomfang** for as long as possible. She also sheds light on Venomfang’s deep hatred for the Cult, giving the group yet another potential ally—or enemy.\n\nSuddenly, **Paimon** seizes control of Astaroth’s body, his voice echoing with a demonic distortion. He delivers an urgent message: **three members of the Black Eagles**, including **Aldous Khosan**, have split from the main trail and are waiting nearby for the party before proceeding. The possession fades, leaving Astaroth shaken but alive.\n\nBefore departing, the group questions Eva and Seraphina about **Jamna** and **Matthew**, the supposed operatives they had encountered earlier. To their surprise, both leaders deny ever sending them. The pair were **impostors**, and whatever mission they claimed to serve was fabricated. Alarmed, Seraphina vows to open a formal investigation through the Gauntlet, while Eva promises to handle the Zhentarim’s end.\n\nBefore dismissing them, both leaders give one last recommendation: acquire **Amulets of Proof Against Detection and Location**, for their enemies have eyes—and spells—everywhere. With this warning, the group prepares once more to travel into uncertainty, their alliances forged, their enemies multiplying, and the storm far from over."
  }
]
