[
  {
    "session": 39,
    "chapter": 7,
    "title": "Journey to Waterdeep",
    "date": "1st–10th of Kythorn",
    "characters": [
      "Governor Nighthill",
      "Sir Polaris",
      "Cylyria Dragonbreast",
      "Keene Nine-Fingers",
      "Soren",
      "Eru Summering",
      "Astaroth",
      "Astéria",
      "Advenssax"
    ],
    "summary": "With Keene’s help, the group begins their calm voyage to Waterdeep. Through Sendings, they reach out to their allies—Nighthill, Sir Polaris, and Cylyria—seeking support and evidence against the Cult of the Dragon. While Nighthill agrees to help, Polaris and Cylyria prove hesitant. Near Daggerford, tragedy strikes through a vision: Soren’s beloved Maldwyn Daggerford has been murdered by the Cult.",
    "full_text": "With the chaos of Baldur’s Gate behind them, the party begins their journey north toward **Waterdeep**, once again traveling by ship. Thanks to **Keene Nine-Fingers**, who personally handled the bureaucratic mess of acquiring safe passage, their voyage proves uneventful—for the most part. The sea breeze carries calm rather than danger, giving the adventurers time to reflect, train, and prepare for whatever lies ahead.\n\nEarly into the voyage, the group agrees to contact their allies via **Sending**, hoping to gather tangible proof and political leverage for when they reach the **Lord’s Alliance**. They craft a single, unified message to send to each of their contacts:\n\n> *“We’re heading to Waterdeep to stop the Cult. We want to warn the Lord’s Alliance but need evidence of their activities. Can you help us?”*\n\nThe responses come in one by one:\n\n> **Governor Nighthill:** “It would be my pleasure to assist. I will send a sealed letter to the Waterdeep Post, detailing the attack. The password to retrieve it will be *Green Fields*.”\n\n> **Sir Polaris:** “I’ll forward your request to Lord Kelddath. Send another Sending tomorrow, at the same hour, for his response.”\n\n> **Cylyria Dragonbreast:** “I do not believe involving the Lord’s Alliance now is wise. They will demand mountains of proof, which we do not yet have. I advise a different course.”\n\nThe group debates Cylyria’s reluctance but decides to follow through with Polaris’ contact. The next day, they send another Sending:\n\n> *“We’ll arrive in Waterdeep in about ten days. We need tangible evidence before then. What did Lord Kelddath say?”*\n\n> **Sir Polaris:** “Lord Kelddath refuses to aid a fugitive and a convicted criminal who escaped Baldur’s Gate’s justice.”\n\nThe air grows tense as the group realizes their reputation is beginning to haunt them. Nonetheless, they reach out to Cylyria again:\n\n> *“We infiltrated the cult’s base in Baldur’s Gate and found a detailed report on the Draconian Operation. Isn’t that enough?”*\n\n> **Cylyria Dragonbreast:** “I still disagree. This is not a matter to be discussed through Sendings. It requires calm conversation.”\n\nA day later, as dawn breaks over the misty waves, Cylyria initiates a **Scrying** spell, projecting her ethereal presence aboard their vessel. The group hastily gathers their evidence—notes, runes, and the recovered **Draconian Report**—and presents them. The connection fades shortly after, but another Sending arrives soon after:\n\n> **Cylyria Dragonbreast:** “I’d like to study the book more carefully. These are vital insights into the Cult’s plans. The Alliance is made up of bureaucrats—they will deliberate endlessly before acting. We, however, can move swiftly and decisively.”\n\n> *“What do you suggest, then? Isn’t it better to start the bureaucratic process early, while we can?”*\n\n> **Cylyria:** “No. Work with me instead. Contact me again the day you reach Waterdeep—I’ll send instructions for how to deliver the book safely.”\n\nThe group agrees reluctantly, choosing pragmatism over protocol. The following days pass quietly as the ship drifts up the **Chiontar River** and then out into the **Sea of Swords**, cutting a path along the Sword Coast.\n\nBut on the eighth day, as the ship nears **Daggerford**, the group is struck by another vision—a cruel one. They see **Maldwyn Daggerford**, the Duke of Daggerford and the man Soren once loved, being brutally executed by the **Cult of the Dragon**. His lifeless body falls from the castle walls, marked with the cult’s draconic insignia, and the final words carved into the stone: *“For Soren.”*\n\nThe message is unmistakable. The cult’s vengeance is personal.\n\nSilence falls over the ship. No songs, no laughter—only the steady rhythm of the waves against the hull. The crew respects the quiet mourning of their passengers.\n\nBy the tenth day, **Waterdeep’s** skyline pierces the mist ahead—tall spires, banners of blue and gold, and the faint hum of a city that never truly sleeps. The group steps onto the docks with heavy hearts, their grief tempered by resolve. A new chapter begins, and the greatest city on the Sword Coast awaits them."
  }
]
