[
  {
    "session": 1,
    "chapter": 1,
    "title": "Journey to Greenest",
    "date": "21st–27th of Ches",
    "characters": [
      "Baron Latife",
      "Garreck",
      "Merchants",
      "Villagers"
    ],
    "summary": "We left Berdusk as hired guards for Baron Latife’s caravan, getting to know each other on the road. Rumors about a blue dragon kept surfacing, and a robbed hamlet asked us to warn Governor Nighthill in Greenest. By the end of the week, tensions inside the party had simmered but we were close to town.",
    "full_text": "We set out from Berdusk bound for Greenest under Baron Latife’s leadership, hired as caravan guards for pay. At the crossroads east to Iriaebor or south to Greenest, we gathered around the fire. Eru and Soren made the rounds, introducing themselves to each of us. Advenssax, a proud Dragonborn soldier, kept a level, neither-friendly-nor-hostile tone. Astaroth, more withdrawn, revealed his horns when pressed, making the ground tremble with his presence; he had little patience for the pair’s over-friendly demeanor and drove them off with a raised voice. Asteria proved cool and elegant in manner; the talk flowed until Eru made an unkind remark, ending it abruptly. \n\nBaron Latife then formally addressed us—Advenssax, Astaroth, and Asteria—presenting us to one another, courteous but subtly dominant toward Asteria. He offered coin in exchange for protection, and we accepted. As the days passed, stories were traded across the wagons. Eru teased Advenssax by bringing up a blue dragon, and later we found a hamlet that had been robbed by bandits. The elder there shared what he knew and, while grateful for supplies from the merchants, asked us to inform Governor Nighthill of Greenest about the raiders. A child ran to Eru, insisting he had seen a blue dragon; his parents dismissed it, though even the elder allowed it might be true. On the road we also heard a long tale about werewolves and wolfweres in a nearby region. \n\nAfter days without incident but weary from travel, Eru apologized to Astaroth, who accepted but asked to be left alone; he then did the same with Asteria, who also accepted. Advenssax and Astaroth grew closer, often taking the front line together while on duty. By the end of the tenday we were within reach of Greenest, unaware of what waited under brewing storm clouds."
  },
  {
    "session": 2,
    "chapter": 1,
    "title": "Siege of Greenest — Part I",
    "date": "27th of Ches",
    "characters": [
      "Garreck Boulderslam",
      "Swift Family",
      "Villagers",
      "Sergeant Markguth",
      "Escobert",
      "Lia",
      "Hozorlig",
      "Elemmírë"
    ],
    "summary": "Storms gathered over Greenest and a blue dragon circled above as panic seized the town. We fought through kobolds to reach the keep, met Escobert and Sergeant Markguth, and took on a mission to check the mill. There we crossed paths with Lia, Hozorlig, and Elemmírë—tensions flared, but the fires were contained.",
    "full_text": "As Greenest came into view, prosperity was nowhere to be seen—only stormclouds roiling like they sought the town alone. Advenssax murmured to Astaroth that such tempests could be the work of a storm-blooded dragon. We climbed for a better look and saw people fleeing in terror while a blue dragon swept the skies. Garreck Boulderslam, desperate for his wife Gayle and his city, pleaded for our help. We pressed into town. A family—parents with two children—were cornered by kobolds and badly injured. We cut the attackers down and moved on. \n\nThe keep was the only safe place amidst the chaos. Harried and pursued, we reached it and faced wary guards. Sergeant Markguth’s arrival eased the pressure. We waited in the courtyard for the castellan. When Escobert arrived, we were able to explain ourselves and finally secure shelter. During the respite, Escobert gauged our intentions; when he asked if Soren spoke for us, Triple-A (Advenssax, Astaroth, Asteria) refused, which stung Soren but clarified where we stood. Astaroth taught Advenssax chess as the two warmed to each other. Soren and Eru debated mischief and order; Soren felt slighted by Triple-A’s earlier refusal. Eru coaxed apologies out of Advenssax (for a silver) and Astaroth (for two), with Soren serenading the arrangement. \n\nWhen Escobert returned with hot soup, he assigned us to inspect the mill, apparently ablaze. Rewards would come later from Governor Nighthill. We followed the river, engaged more kobolds and cultists, and then encountered a trio: Lia (human swordswoman), Hozorlig (dwarven monk), and Elemmírë (wood-elf ranger). After we aided them, grief and temper ran hot—Lia mourned, and Elemmírë bristled at us. Astaroth challenged his hostility; the elf snapped back, and a taunt from Astaroth drew arrow and talons. Though wounded, Astaroth stood firm until Lia slapped sense into Elemmírë and Hozorlig apologized, flashing a medallion of the Manifesto. Advenssax and the elf put out the mill’s flames while Asteria and Astaroth searched the fallen."
  },
  {
    "session": 3,
    "chapter": 1,
    "title": "Siege of Greenest — Part II",
    "date": "27th of Ches",
    "characters": [
      "Jett Squad",
      "Sergeant Markguth",
      "Escobert",
      "Governor Nighthill",
      "Sir Polaris II"
    ],
    "summary": "Back at the keep, reports were given and we tried to rest—until the blue dragon descended on the walls. After a brutal defense, Langdedrosa Cyanwrath challenged a champion; Hozorlig fell in the duel, but the prisoner was freed—Garreck’s wife, Gayle.",
    "full_text": "With the mill handled, we returned alongside the Jett Squad and descended to the keep’s undercroft near the infirmary. Markguth, Escobert, and Governor Nighthill heard our report of a false fire, an ambush, and Rondor’s death. A captured cultist was finally handed over. We were given rooms to rest; through the thin walls we heard Lia grieving. Soren invited Asteria to rejoin the others to discuss whether we would lean into chaos or order. The debate flared—Advenssax and Astaroth argued for freedom and individuality; Soren and Eru, for unity and discipline. Eru pushed too far, calling Advenssax a white dragon; Asteria kept her poise. The room rattled as tempers rose, and Soren eventually stepped out to write a poem for Lia. \n\nAstaroth nursed wounds, then traded war stories with Advenssax and Asteria—Avernus, the Hells, Zariel, Tiamat. Quiet followed until thunder shook the stone. We ran for the battlements as the blue dragon fell upon the walls. Guards died screaming; Lia nearly joined them before rallying. Fighting as one, we forced the dragon to withdraw and the storm slowly eased. Then a blue Dragonborn approached with kobolds: Langdedrosa Cyanwrath, issuing a duel for the town’s strongest. Advenssax and Hozorlig exchanged looks; injured, Advenssax stood down and Hozorlig took the honor. The duel was fast, fierce, and technical—but Hozorlig fell. Cyanwrath kept his word, releasing his ‘useless’ prisoner. Relief and tears—Garreck’s wife, Gayle, lived. \n\nHealers worked on Hozorlig while Astaroth lay in the grass beside him, sharing a quiet moment about the night’s horrors. The Knights of Lathander arrived in a sweep of warm radiance like a ‘small sun.’ Sir Polaris II led them, taking a post before the keep while he himself entered to speak with Nighthill. We followed."
  },
  {
    "session": 4,
    "chapter": 1,
    "title": "The Day After the Invasion — Part I",
    "date": "28th of Ches",
    "characters": [
      "Escobert",
      "Sergeant Markguth",
      "Governor Nighthill",
      "Sir Polaris II"
    ],
    "summary": "With Greenest secured, we joined a war council. Interrogations pointed to a Cult of the Dragon camp guarding dragon eggs under Frulam Mondath. Nesim revealed that Leosin is a senior Harper and urged secrecy and a rescue. The group argued, set roles, and prepared to infiltrate.",
    "full_text": "With the crisis contained, Nighthill convened a war council and named us ‘reliable adventurers.’ Reports confirmed a Cult of the Dragon camp nearby, possibly guarding dragon eggs. A new name surfaced: Frulam Mondath—commander and divine caster—likely behind the region’s raids. Advenssax argued that Gayle might hold useful details from her captivity, but Escobert doubted it. Then Nesim Waladra and Eadyan Falconmoon arrived. Nesim explained that during the chaos, the temple had been assailed and, though defended, Leosin Erlanthar—his master—had been captured (or had allowed it). \n\nThe plan: infiltrate the cult as mercenaries, gather intelligence, and, if possible, recover an egg. Nighthill and Escobert promised disguises, supplies, and pay. After the meeting, Nesim pulled us aside and entrusted us with Leosin’s secret—he is a senior Harper with deep insight into the cult’s leadership. His survival and knowledge were paramount, and we were urged to keep the Harper affiliation absolutely quiet. \n\nBack in our quarters, we found a letter from Baron Latife praising our efforts, leaving our pay with Escobert, and—more importantly—suggesting we formalize our party. Debate flared again: Eru lashed out with mage hand and was checked; tempers cooled more quickly this time. A compromise emerged: Advenssax would hold the loot for a 10% fee from each member; Soren would try to mediate with Eru. In the morning, Escobert and Nighthill furnished our disguises and coin. Escobert’s briefing was clear: rescue Leosin, estimate the enemy’s strength, verify Frulam’s position, determine the dragon’s chain of command, identify the next target, and confirm whether the eggs are real."
  },
  {
    "session": 5,
    "chapter": 1,
    "title": "The Day After the Invasion — Part II",
    "date": "28th of Ches",
    "characters": [
      "Escobert",
      "Sergeant Markguth",
      "Governor Nighthill",
      "Sir Polaris II",
      "Lia",
      "Hozorlig",
      "Eadyan Falconmoon",
      "Charles Swiftwind",
      "Carlton Swiftwind",
      "Garreck",
      "Gayle"
    ],
    "summary": "We paid our respects at a memorial service led by Eadyan; Soren’s performance brought comfort to the grieving. Supplied by Escobert, we purchased donkeys and a cart from Charles Swiftwind. Before leaving, Charles asked us to warn his brother Carlton in Berdusk about the family tragedy.",
    "full_text": "Before departing on the infiltration mission, Eru asked Escobert for healing potions; the castellan promised to speak with the governor and see what could be spared. On the keep’s stairs we met Lia in mourning black; she invited us to the infirmary to visit the Swift family. Hozorlig, bandaged but upright, insisted on attending the memorial despite Lia’s protests. After we explained our plan, we gave them a moment of privacy and checked on Gayle with Garreck at her side. \n\nAt the ceremony, Eadyan officiated heartfelt tributes for those lost in the siege. When Rondor’s name was spoken, Elemmírë’s hawk Jett delivered a cherry blossom to Lia, who broke down in tears. Soren sang and played to soothe the mourners. Afterward, Eadyan thanked him and, on Escobert’s behalf, granted each of us a healing potion. He directed us to Charles Swiftwind’s ranch for mounts and gear. \n\nCharles—elderly but steadfast—sold us donkeys, tack, and a cart. Soren bought one for himself; soon, the rest of us did the same. Before we left, Charles asked a favor: inform his brother, Carlton Swiftwind, proprietor of the Running Stag Inn in Berdusk, about the deaths in their family so he could come help. We also promised (and then promptly forgot) to send Hozorlig to help hire temporary hands for the ranch. With supplies secured and respects paid, we were finally ready to turn toward the cult’s trail."
  }
]