[
  {
    "session": 11,
    "chapter": 3,
    "title": "The Dragon Hatchery – Part I",
    "date": "4th–6th of Tarsakh",
    "characters": [
      "Astaroth",
      "Soren",
      "Advenssax",
      "Eru",
      "Asteria",
      "Langdedrosa",
      "Frulam Mondath",
      "Roper",
      "Paimon"
    ],
    "summary": "The group delves into the dragon hatchery, uncovering horrors within its depths. Battles against cultists, drakes, and the dragonborn Langdedrosa test their endurance as they descend into the lair where dragon eggs rest beneath the watch of something monstrous.",
    "full_text": "With all instructions from Nighthill clear, the group set off toward the cult’s camp once more, this time to gather intelligence and discover what had become of the dragon hatchery. Their journey was quiet, save for a brief exchange between Soren and Astaroth about Sir Polaris. Before long, the camp appeared on the horizon. Strategizing their approach, Astaroth unveiled Paimon — a mischievous imp now bound to him — who offered to scout ahead in exchange for a few gold coins. Invisible, Paimon flew into the darkness of the caverns ahead while the group followed on foot.\n\nInside the hatchery, Paimon’s mental whispers guided Astaroth through narrow passages. The group cut down several cultists and kobolds before facing strange glowing fungi that erupted into aggression when disturbed. After barely surviving, they pressed on into a chamber where untrained guard drakes attacked. The battle was brutal, but victory was theirs.\n\nWhile they attempted a brief rest, Paimon returned with grim news — Langdedrosa and a barbarian champion were on their way. The half-dragon stormed into the chamber, his weapon crackling with lightning. Advenssax fell under his might, but in the heat of desperation, Astaroth invoked Mammon’s aid — a dark bargain that restored Advenssax fully to life. With renewed fury, the group brought down both Langdedrosa and his ally. They rested among the corpses before venturing deeper.\n\nIn the heart of the hatchery, they discovered a temple to Tiamat, its mural depicting the goddess emerging from a volcano. A wave of pain struck their minds, and the image vanished from memory. In the next chamber, Frulam Mondath sat writing a letter. The ensuing battle was vicious — Frulam struck down Advenssax once again before she herself was slain. Her magical staff, robes, and letter were taken, revealing secrets of the Cult’s next movements. Astaroth then performed a blasphemous ritual to Mammon, offering Frulam’s soul in exchange for infernal favor. Flames of gold and black filled the altar as her body was consumed.\n\nFurther within, they reached the dragon nursery — and the truth behind the visions. Within the cavern lay eggs guarded by mature drakes and a monstrous creature of flesh and tendrils — a Roper. The group’s attacks failed until Soren bravely threatened to destroy an egg, forcing the Roper into negotiation. It agreed to feast instead on Langdedrosa’s corpse. The creature devoured it whole, earning from Soren the title ‘Ugly Mighty Octopus’. Afterward, the group debated the eggs’ fate. Mammon demanded them all. Most agreed, though Soren resisted. When parasitic creatures later hatched from one egg, Advenssax rescued the last intact one while the others were lost. Their infernal deal remained intact — barely."
  },
  {
    "session": 13,
    "chapter": 3,
    "title": "Cult Cell Destroyed — What Now?",
    "date": "7th–9th of Tarsakh",
    "characters": [
      "Astaroth",
      "Soren",
      "Advenssax",
      "Eru",
      "Asteria",
      "Charles Swiftwind",
      "Escobert",
      "Nighthill",
      "Hozorlig",
      "Lia"
    ],
    "summary": "The group returns to Greenest after destroying the cult’s hatchery. They bargain with Mammon, lie to Nighthill about the dragon eggs, and decide their next course toward Soubar, while the shadows of the Cult still loom.",
    "full_text": "Shaken by the battle and the loss of a young black dragon, Eru briefly transformed into a woman — his aunt — a strange display of magic that bewildered the party before fading away. As they journeyed back toward Greenest, Eru practiced his shapeshifting, mimicking his companions one by one while silence lingered among them. During twilight, Asteria and Soren shared a private conversation about recent events and uncertain futures.\n\nBefore reaching the city, Astaroth gathered everyone to agree on a story: they would claim that all three dragon eggs had been destroyed by parasites. Upon arrival at Charles Swiftwind’s ranch, the group enacted their pact — burning the final surviving egg as an offering to Mammon. Violet flames consumed it, and infernal whispers echoed through the night. Meanwhile, Charles scolded Eru and Asteria for neglecting their previous promise. Soren, Astaroth, and Advenssax completed the offering, the infernal flame engulfing the egg as Mammon accepted his prize.\n\nThe group later returned to Greenest’s fortress and reported to Governor Nighthill, Escobert, Lia, and Hozorlig. They recounted their victory over Frulam Mondath and Langdedrosa, delivered her letter revealing stolen Greenest goods, and mentioned a new target — Soubar. Though Nighthill urged caution and proposed traveling to Baldur’s Gate instead, the group insisted on heading for Soubar, vowing to alert Baldur’s Gate once they reached Berdusk. Escobert, touched by their honesty and the recovered items, offered to buy them back cheaply to return them to the grieving families of Greenest. The group agreed — a small light in the shadow of the Cult of the Dragon."
  }
]